#pragma once

// Lineage 2 (Gracia Final) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace L2_SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.PendingLevel
// 0x00A8 (0x00DC - 0x0034)
class UPendingLevel : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0034(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PendingLevel");
		return ptr;
	}

};


// Class Engine.NetPendingLevel
// 0x0000 (0x00DC - 0x00DC)
class UNetPendingLevel : public UPendingLevel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NetPendingLevel");
		return ptr;
	}

};


// Class Engine.NetDriver
// 0x006C (0x00A4 - 0x0038)
class UNetDriver : public USubsystem
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET
	float                                              ConnectionTimeout;                                        // 0x0058(0x0004) (Config)
	float                                              InitialConnectTimeout;                                    // 0x005C(0x0004) (Config)
	float                                              KeepAliveTime;                                            // 0x0060(0x0004) (Config)
	float                                              RelevantTimeout;                                          // 0x0064(0x0004) (Config)
	float                                              SpawnPrioritySeconds;                                     // 0x0068(0x0004) (Config)
	float                                              ServerTravelPause;                                        // 0x006C(0x0004) (Config)
	int                                                MaxClientRate;                                            // 0x0070(0x0004) (Config)
	int                                                NetServerMaxTickRate;                                     // 0x0074(0x0004) (Config)
	int                                                LanServerMaxTickRate;                                     // 0x0078(0x0004) (Config)
	unsigned long                                      AllowDownloads : 1;                                       // 0x007C(0x0004) (Config)
	unsigned char                                      UnknownData01[0x14];                                      // 0x0080(0x0014) MISSED OFFSET
	int                                                MaxDownloadSize;                                          // 0x0094(0x0004) (Config)
	TArray<struct FString>                             DownloadManagers;                                         // 0x0098(0x000C) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NetDriver");
		return ptr;
	}

};


// Class Engine.PackageMapLevel
// 0x0004 (0x0080 - 0x007C)
class UPackageMapLevel : public UPackageMap
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x007C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PackageMapLevel");
		return ptr;
	}

};


// Class Engine.Download
// 0x042C (0x0460 - 0x0034)
class UDownload : public UObject
{
public:
	unsigned char                                      UnknownData00[0x42C];                                     // 0x0034(0x042C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Download");
		return ptr;
	}

};


// Class Engine.ChannelDownload
// 0x0004 (0x0464 - 0x0460)
class UChannelDownload : public UDownload
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0460(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ChannelDownload");
		return ptr;
	}

};


// Class Engine.DemoRecDriver
// 0x0078 (0x011C - 0x00A4)
class UDemoRecDriver : public UNetDriver
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x00A4(0x000C) MISSED OFFSET
	struct FString                                     DemoSpectatorClass;                                       // 0x00B0(0x000C) (Config, NeedCtorLink)
	unsigned char                                      UnknownData01[0x60];                                      // 0x00BC(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DemoRecDriver");
		return ptr;
	}

};


// Class Engine.Player
// 0x0040 (0x0074 - 0x0034)
class UPlayer : public UObject
{
public:
	int                                                vfOut;                                                    // 0x0034(0x0004) (Const, Native)
	int                                                vfExec;                                                   // 0x0038(0x0004) (Const, Native)
	class APlayerController*                           Actor;                                                    // 0x003C(0x0004) (Const, Transient)
	class UInteraction*                                Console;                                                  // 0x0040(0x0004) (Transient)
	unsigned long                                      bWindowsMouseAvailable : 1;                               // 0x0044(0x0004) (Const, Transient)
	unsigned long                                      bShowWindowsMouse : 1;                                    // 0x0044(0x0004)
	unsigned long                                      bSuspendPrecaching : 1;                                   // 0x0044(0x0004)
	float                                              WindowsMouseX;                                            // 0x0048(0x0004) (Const, Transient)
	float                                              WindowsMouseY;                                            // 0x004C(0x0004) (Const, Transient)
	int                                                CurrentNetSpeed;                                          // 0x0050(0x0004)
	int                                                ConfiguredInternetSpeed;                                  // 0x0054(0x0004) (Config, GlobalConfig)
	int                                                ConfiguredLanSpeed;                                       // 0x0058(0x0004) (Config, GlobalConfig)
	unsigned char                                      SelectedCursor;                                           // 0x005C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	class UInteractionMaster*                          InteractionMaster;                                        // 0x0060(0x0004) (Transient)
	TArray<class UInteraction*>                        LocalInteractions;                                        // 0x0064(0x000C) (Transient, NeedCtorLink)
	class UBaseGUIController*                          GUIController;                                            // 0x0070(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Player");
		return ptr;
	}

};


// Class Engine.NetConnection
// 0x3EB0 (0x3F24 - 0x0074)
class UNetConnection : public UPlayer
{
public:
	unsigned char                                      UnknownData00[0x3EB0];                                    // 0x0074(0x3EB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NetConnection");
		return ptr;
	}

};


// Class Engine.DemoRecConnection
// 0x0000 (0x3F24 - 0x3F24)
class UDemoRecConnection : public UNetConnection
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DemoRecConnection");
		return ptr;
	}

};


// Class Engine.DemoPlayPendingLevel
// 0x0000 (0x00DC - 0x00DC)
class UDemoPlayPendingLevel : public UPendingLevel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DemoPlayPendingLevel");
		return ptr;
	}

};


// Class Engine.Channel
// 0x003C (0x0070 - 0x0034)
class UChannel : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0034(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Channel");
		return ptr;
	}

};


// Class Engine.FileChannel
// 0x0210 (0x0280 - 0x0070)
class UFileChannel : public UChannel
{
public:
	unsigned char                                      UnknownData00[0x210];                                     // 0x0070(0x0210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.FileChannel");
		return ptr;
	}

};


// Class Engine.ActorChannel
// 0x0064 (0x00D4 - 0x0070)
class UActorChannel : public UChannel
{
public:
	unsigned char                                      UnknownData00[0x64];                                      // 0x0070(0x0064) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ActorChannel");
		return ptr;
	}

};


// Class Engine.ControlChannel
// 0x0004 (0x0074 - 0x0070)
class UControlChannel : public UChannel
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0070(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ControlChannel");
		return ptr;
	}

};


// Class Engine.Actor
// 0x0388 (0x03BC - 0x0034)
class AActor : public UObject
{
public:
	TEnumAsByte<EPhysics>                              Physics;                                                  // 0x0034(0x0001) (Edit, Const)
	TEnumAsByte<EDrawType>                             DrawType;                                                 // 0x0035(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0036(0x0002) MISSED OFFSET
	class UStaticMesh*                                 StaticMesh;                                               // 0x0038(0x0004) (Edit, Const)
	class AActor*                                      Owner;                                                    // 0x003C(0x0004) (Const)
	class AActor*                                      Base;                                                     // 0x0040(0x0004) (Const)
	struct FActorRenderDataPtr                         ActorRenderData;                                          // 0x0044(0x0004) (Const, Native)
	struct FLightRenderDataPtr                         LightRenderData;                                          // 0x0048(0x0004) (Const, Native)
	int                                                RenderRevision;                                           // 0x004C(0x0004) (Const, Native)
	struct FName                                       ForcedVisibilityZoneTag;                                  // 0x0050(0x0004) (Edit, Const)
	TEnumAsByte<EFilterState>                          StaticFilterState;                                        // 0x0054(0x0001) (Const, Native)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	int                                                CreatureID;                                               // 0x0058(0x0004)
	unsigned long                                      NoCheatCollision : 1;                                     // 0x005C(0x0004)
	unsigned long                                      CanIngnoreCollision : 1;                                  // 0x005C(0x0004)
	unsigned long                                      bDeleteNow : 1;                                           // 0x005C(0x0004)
	unsigned long                                      bAlwaysVisible : 1;                                       // 0x005C(0x0004)
	unsigned long                                      bDynamicActorFilterState : 1;                             // 0x005C(0x0004)
	unsigned long                                      bSpecialLit : 1;                                          // 0x005C(0x0004) (Edit)
	unsigned long                                      bActorShadows : 1;                                        // 0x005C(0x0004) (Edit)
	unsigned long                                      bCorona : 1;                                              // 0x005C(0x0004) (Edit)
	unsigned long                                      bLightingVisibility : 1;                                  // 0x005C(0x0004) (Edit)
	unsigned long                                      bUseDynamicLights : 1;                                    // 0x005C(0x0004) (Edit)
	unsigned long                                      bLightChanged : 1;                                        // 0x005C(0x0004)
	unsigned long                                      bUpdateShadow : 1;                                        // 0x005C(0x0004)
	unsigned long                                      bHideShadow : 1;                                          // 0x005C(0x0004)
	unsigned long                                      bHideRightHandMesh : 1;                                   // 0x005C(0x0004)
	unsigned long                                      bHideLeftHandMesh : 1;                                    // 0x005C(0x0004)
	unsigned long                                      bNeedCleanup : 1;                                         // 0x005C(0x0004)
	unsigned long                                      bShadowOnly : 1;                                          // 0x005C(0x0004)
	unsigned long                                      bStatic : 1;                                              // 0x005C(0x0004) (Edit, Const)
	unsigned long                                      bHidden : 1;                                              // 0x005C(0x0004) (Edit)
	unsigned long                                      bNoDelete : 1;                                            // 0x005C(0x0004) (Edit, Const)
	unsigned long                                      bDeleteMe : 1;                                            // 0x005C(0x0004) (Const)
	unsigned long                                      bTicked : 1;                                              // 0x005C(0x0004) (Const, Transient)
	unsigned long                                      bDynamicLight : 1;                                        // 0x005C(0x0004) (Edit)
	unsigned long                                      bTimerLoop : 1;                                           // 0x005C(0x0004)
	unsigned long                                      bOnlyOwnerSee : 1;                                        // 0x005C(0x0004)
	unsigned long                                      bHighDetail : 1;                                          // 0x005C(0x0004) (Edit)
	unsigned long                                      bSuperHighDetail : 1;                                     // 0x005C(0x0004) (Edit)
	unsigned long                                      bOnlyDrawIfAttached : 1;                                  // 0x005C(0x0004)
	unsigned long                                      bStasis : 1;                                              // 0x005C(0x0004) (Edit)
	unsigned long                                      bTrailerAllowRotation : 1;                                // 0x005C(0x0004)
	unsigned long                                      bTrailerSameRotation : 1;                                 // 0x005C(0x0004)
	unsigned long                                      bTrailerPrePivot : 1;                                     // 0x005C(0x0004)
	unsigned long                                      bTrailerNoOwnerDestroy : 1;                               // 0x0060(0x0004)
	unsigned long                                      bWorldGeometry : 1;                                       // 0x0060(0x0004) (Edit)
	unsigned long                                      bAcceptsProjectors : 1;                                   // 0x0060(0x0004) (Edit)
	unsigned long                                      bOrientOnSlope : 1;                                       // 0x0060(0x0004)
	unsigned long                                      bOnlyAffectPawns : 1;                                     // 0x0060(0x0004) (Const)
	unsigned long                                      bDisableSorting : 1;                                      // 0x0060(0x0004) (Edit)
	unsigned long                                      bIgnoreEncroachers : 1;                                   // 0x0060(0x0004) (Edit)
	unsigned long                                      bShowOctreeNodes : 1;                                     // 0x0060(0x0004)
	unsigned long                                      bWasSNFiltered : 1;                                       // 0x0060(0x0004)
	unsigned long                                      bNetTemporary : 1;                                        // 0x0060(0x0004) (Const)
	unsigned long                                      bOnlyRelevantToOwner : 1;                                 // 0x0060(0x0004)
	unsigned long                                      bNetDirty : 1;                                            // 0x0060(0x0004) (Const, Transient)
	unsigned long                                      bAlwaysRelevant : 1;                                      // 0x0060(0x0004)
	unsigned long                                      bReplicateInstigator : 1;                                 // 0x0060(0x0004)
	unsigned long                                      bReplicateMovement : 1;                                   // 0x0060(0x0004)
	unsigned long                                      bSkipActorPropertyReplication : 1;                        // 0x0060(0x0004)
	unsigned long                                      bUpdateSimulatedPosition : 1;                             // 0x0060(0x0004)
	unsigned long                                      bTearOff : 1;                                             // 0x0060(0x0004)
	unsigned long                                      bOnlyDirtyReplication : 1;                                // 0x0060(0x0004)
	unsigned long                                      bReplicateAnimations : 1;                                 // 0x0060(0x0004)
	unsigned long                                      bNetInitialRotation : 1;                                  // 0x0060(0x0004) (Const)
	unsigned long                                      bCompressedPosition : 1;                                  // 0x0060(0x0004)
	unsigned long                                      bAlwaysZeroBoneOffset : 1;                                // 0x0060(0x0004)
	int                                                VehicleID;                                                // 0x0064(0x0004)
	struct FVector                                     RelativeLocInVehicle;                                     // 0x0068(0x000C)
	struct FRotator                                    L2DesriedRotator;                                         // 0x0074(0x000C)
	unsigned long                                      bVehicleTargetMove : 1;                                   // 0x0080(0x0004)
	unsigned long                                      bVehicleCompensativeMove : 1;                             // 0x0080(0x0004)
	unsigned long                                      bHasActorTarget : 1;                                      // 0x0080(0x0004)
	unsigned long                                      bL2DesiredRotated : 1;                                    // 0x0080(0x0004)
	unsigned long                                      L2NeedTick : 1;                                           // 0x0080(0x0004)
	unsigned long                                      bCheckChangableLevel : 1;                                 // 0x0080(0x0004)
	unsigned long                                      bImmediatelyStop : 1;                                     // 0x0080(0x0004)
	unsigned long                                      bNeedPostSpawnProcess : 1;                                // 0x0080(0x0004)
	unsigned long                                      bRelativeTrail : 1;                                       // 0x0080(0x0004)
	unsigned long                                      bSelfRotation : 1;                                        // 0x0080(0x0004) (Edit)
	struct FVector                                     RelativeTrailOffset;                                      // 0x0084(0x000C)
	unsigned long                                      bUseL2ActorViewType : 1;                                  // 0x0090(0x0004)
	float                                              L2ActorViewDuration;                                      // 0x0094(0x0004)
	float                                              L2ActorViewElapsedTime;                                   // 0x0098(0x0004)
	TEnumAsByte<EActorViewType>                        L2ActorViewtype;                                          // 0x009C(0x0001)
	TEnumAsByte<ELodBlendViewType>                     L2LodViewType;                                            // 0x009D(0x0001)
	unsigned char                                      UnknownData02[0x2];                                       // 0x009E(0x0002) MISSED OFFSET
	float                                              L2LodViewDuration;                                        // 0x00A0(0x0004)
	float                                              L2LodViewElapsedTime;                                     // 0x00A4(0x0004)
	int                                                L2CurrentLod;                                             // 0x00A8(0x0004)
	int                                                L2ServerObjectRealID;                                     // 0x00AC(0x0004)
	int                                                L2ServerObjectID;                                         // 0x00B0(0x0004) (Edit)
	TEnumAsByte<EL2ObjectType>                         L2ServerObjectType;                                       // 0x00B4(0x0001) (Edit, Const)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x00B5(0x0001)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x00B6(0x0001)
	unsigned char                                      UnknownData03[0x1];                                       // 0x00B7(0x0001) MISSED OFFSET
	int                                                NetTag;                                                   // 0x00B8(0x0004) (Const, Transient)
	float                                              NetUpdateTime;                                            // 0x00BC(0x0004)
	float                                              NetUpdateFrequency;                                       // 0x00C0(0x0004)
	float                                              NetPriority;                                              // 0x00C4(0x0004)
	class APawn*                                       Instigator;                                               // 0x00C8(0x0004)
	struct FName                                       AttachmentBone;                                           // 0x00CC(0x0004) (Const)
	TEnumAsByte<EAttachType>                           AttachType;                                               // 0x00D0(0x0001)
	unsigned char                                      UnknownData04[0x3];                                       // 0x00D1(0x0003) MISSED OFFSET
	class ALevelInfo*                                  Level;                                                    // 0x00D4(0x0004) (Const)
	class ULevel*                                      XLevel;                                                   // 0x00D8(0x0004) (Const, Transient)
	float                                              LifeSpan;                                                 // 0x00DC(0x0004) (Edit)
	struct AActor_FPointRegion                         Region;                                                   // 0x00E0(0x000C) (Edit, Const)
	struct FName                                       ForcedRegionTag;                                          // 0x00EC(0x0004) (Edit, Const)
	int                                                ForcedRegion;                                             // 0x00F0(0x0004) (Edit, Const)
	float                                              TimerRate;                                                // 0x00F4(0x0004)
	class UMesh*                                       Mesh;                                                     // 0x00F8(0x0004) (Edit)
	class UMeshContainer*                              MeshContainer;                                            // 0x00FC(0x0004) (Transient)
	unsigned long                                      bReadyToRender : 1;                                       // 0x0100(0x0004)
	unsigned long                                      bSunAffect : 1;                                           // 0x0100(0x0004) (Edit)
	float                                              LastRenderTime;                                           // 0x0104(0x0004) (Transient)
	struct FName                                       Tag;                                                      // 0x0108(0x0004) (Edit)
	TArray<int>                                        Leaves;                                                   // 0x010C(0x000C) (Transient, NeedCtorLink)
	struct FName                                       Event;                                                    // 0x0118(0x0004) (Edit)
	TArray<struct FL2Event>                            L2GameEvent;                                              // 0x011C(0x000C) (Edit, NeedCtorLink)
	class AInventory*                                  Inventory;                                                // 0x0128(0x0004)
	float                                              TimerCounter;                                             // 0x012C(0x0004) (Const)
	class UMeshInstance*                               MeshInstance;                                             // 0x0130(0x0004) (Transient)
	struct FName                                       L2MoveEvent;                                              // 0x0134(0x0004) (Edit)
	TEnumAsByte<ETargetSpineStatus>                    TargetSpineStatus;                                        // 0x0138(0x0001)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0139(0x0003) MISSED OFFSET
	float                                              LODBias;                                                  // 0x013C(0x0004) (Edit)
	struct FName                                       InitialState;                                             // 0x0140(0x0004) (Edit)
	struct FName                                       Group;                                                    // 0x0144(0x0004) (Edit)
	TArray<class AActor*>                              Child;                                                    // 0x0148(0x000C) (Const, NeedCtorLink)
	TArray<class AActor*>                              Touching;                                                 // 0x0154(0x000C) (Const, NeedCtorLink)
	TArray<int>                                        OctreeNodes;                                              // 0x0160(0x000C) (Const, Transient, NeedCtorLink)
	struct FBox                                        OctreeBox;                                                // 0x016C(0x001C) (Const, Transient)
	struct FVector                                     OctreeBoxCenter;                                          // 0x0188(0x000C) (Const, Transient)
	struct FVector                                     OctreeBoxRadii;                                           // 0x0194(0x000C) (Const, Transient)
	class AActor*                                      Deleted;                                                  // 0x01A0(0x0004) (Const)
	float                                              LatentFloat;                                              // 0x01A4(0x0004) (Const)
	int                                                CollisionTag;                                             // 0x01A8(0x0004) (Const, Native)
	int                                                JoinedTag;                                                // 0x01AC(0x0004) (Const, Transient)
	class APhysicsVolume*                              PhysicsVolume;                                            // 0x01B0(0x0004) (Const)
	struct FVector                                     Location;                                                 // 0x01B4(0x000C) (Edit, Const)
	struct FRotator                                    Rotation;                                                 // 0x01C0(0x000C) (Edit, Const)
	struct FVector                                     Velocity;                                                 // 0x01CC(0x000C) (Edit)
	struct FVector                                     Acceleration;                                             // 0x01D8(0x000C)
	struct FName                                       AttachTag;                                                // 0x01E4(0x0004) (Edit)
	TArray<class AActor*>                              Attached;                                                 // 0x01E8(0x000C) (Const, NeedCtorLink)
	struct FVector                                     RelativeLocation;                                         // 0x01F4(0x000C) (Const)
	struct FRotator                                    RelativeRotation;                                         // 0x0200(0x000C) (Const)
	unsigned long                                      bHardAttach : 1;                                          // 0x020C(0x0004) (Edit, Const)
	struct FMatrix                                     HardRelMatrix;                                            // 0x0210(0x0040) (Const)
	TArray<struct FProjectorRenderInfoPtr>             Projectors;                                               // 0x0250(0x000C) (Const, Native)
	TArray<struct FStaticMeshProjectorRenderInfoPtr>   StaticMeshProjectors;                                     // 0x025C(0x000C) (Const, Native)
	class UMaterial*                                   Texture;                                                  // 0x0268(0x0004) (Edit)
	class UStaticMeshInstance*                         StaticMeshInstance;                                       // 0x026C(0x0004)
	class UModel*                                      Brush;                                                    // 0x0270(0x0004) (Const, ExportObject)
	float                                              DrawScale;                                                // 0x0274(0x0004) (Edit, Const)
	struct FVector                                     DrawScale3D;                                              // 0x0278(0x000C) (Edit, Const)
	struct FVector                                     PrePivot;                                                 // 0x0284(0x000C) (Edit)
	TArray<class UMaterial*>                           Skins;                                                    // 0x0290(0x000C) (Edit, NeedCtorLink)
	class UMaterial*                                   OverlayMaterial;                                          // 0x029C(0x0004)
	float                                              OverlayTimer;                                             // 0x02A0(0x0004)
	struct FColor                                      OverlayColor;                                             // 0x02A4(0x0004)
	class UMaterial*                                   RepSkin;                                                  // 0x02A8(0x0004)
	unsigned char                                      AmbientGlow;                                              // 0x02AC(0x0001) (Edit)
	unsigned char                                      MaxLights;                                                // 0x02AD(0x0001) (Edit)
	unsigned char                                      UnknownData06[0x2];                                       // 0x02AE(0x0002) MISSED OFFSET
	class UConvexVolume*                               AntiPortal;                                               // 0x02B0(0x0004) (Edit)
	float                                              CullDistance;                                             // 0x02B4(0x0004) (Edit)
	float                                              ScaleGlow;                                                // 0x02B8(0x0004) (Edit)
	float                                              RangeForIgnoredRange;                                     // 0x02BC(0x0004) (Edit)
	int                                                TranslucentRenderPriority;                                // 0x02C0(0x0004) (Edit)
	struct FNMoverPtr                                  NMoverActor;                                              // 0x02C4(0x0004)
	class AL2NMover*                                   L2NMover;                                                 // 0x02C8(0x0004)
	class ULevel*                                      SWXLevel;                                                 // 0x02CC(0x0004) (Const, Transient)
	struct FRotator                                    SwayRotationOrig;                                         // 0x02D0(0x000C)
	TEnumAsByte<ERenderStyle>                          Style;                                                    // 0x02DC(0x0001) (Edit)
	unsigned char                                      UnknownData07[0x3];                                       // 0x02DD(0x0003) MISSED OFFSET
	unsigned long                                      bUnlit : 1;                                               // 0x02E0(0x0004) (Edit)
	unsigned long                                      bShadowCast : 1;                                          // 0x02E0(0x0004) (Edit)
	unsigned long                                      bStaticLighting : 1;                                      // 0x02E0(0x0004) (Edit)
	unsigned long                                      bUseLightingFromBase : 1;                                 // 0x02E0(0x0004) (Edit)
	unsigned long                                      bIgnoredRange : 1;                                        // 0x02E0(0x0004) (Edit)
	unsigned long                                      bUnlitCheck : 1;                                          // 0x02E0(0x0004) (Edit)
	unsigned long                                      bCulledSunlight : 1;                                      // 0x02E0(0x0004)
	unsigned long                                      bHurtEntry : 1;                                           // 0x02E0(0x0004)
	unsigned long                                      bGameRelevant : 1;                                        // 0x02E0(0x0004) (Edit)
	unsigned long                                      bCollideWhenPlacing : 1;                                  // 0x02E0(0x0004) (Edit)
	unsigned long                                      bTravel : 1;                                              // 0x02E0(0x0004)
	unsigned long                                      bMovable : 1;                                             // 0x02E0(0x0004) (Edit)
	unsigned long                                      bDestroyInPainVolume : 1;                                 // 0x02E0(0x0004)
	unsigned long                                      bShouldBaseAtStartup : 1;                                 // 0x02E0(0x0004) (Edit)
	unsigned long                                      bPendingDelete : 1;                                       // 0x02E0(0x0004)
	unsigned long                                      bAnimByOwner : 1;                                         // 0x02E0(0x0004)
	unsigned long                                      bOwnerNoSee : 1;                                          // 0x02E0(0x0004)
	unsigned long                                      bCanTeleport : 1;                                         // 0x02E0(0x0004) (Edit)
	unsigned long                                      bClientAnim : 1;                                          // 0x02E0(0x0004)
	unsigned long                                      bDisturbFluidSurface : 1;                                 // 0x02E0(0x0004)
	unsigned long                                      bAlwaysTick : 1;                                          // 0x02E0(0x0004) (Const)
	float                                              TransientSoundVolume;                                     // 0x02E4(0x0004) (Edit)
	float                                              TransientSoundRadius;                                     // 0x02E8(0x0004) (Edit)
	float                                              CollisionRadius;                                          // 0x02EC(0x0004) (Edit, Const)
	float                                              CollisionHeight;                                          // 0x02F0(0x0004) (Edit, Const)
	unsigned long                                      bCollideActors : 1;                                       // 0x02F4(0x0004) (Edit, Const)
	unsigned long                                      bCollideWorld : 1;                                        // 0x02F4(0x0004) (Edit)
	unsigned long                                      bBlockActors : 1;                                         // 0x02F4(0x0004) (Edit)
	unsigned long                                      bBlockPlayers : 1;                                        // 0x02F4(0x0004) (Edit)
	unsigned long                                      bProjTarget : 1;                                          // 0x02F4(0x0004) (Edit)
	unsigned long                                      bBlockZeroExtentTraces : 1;                               // 0x02F4(0x0004) (Edit)
	unsigned long                                      bBlockNonZeroExtentTraces : 1;                            // 0x02F4(0x0004) (Edit)
	unsigned long                                      bAutoAlignToTerrain : 1;                                  // 0x02F4(0x0004) (Edit)
	unsigned long                                      bUseCylinderCollision : 1;                                // 0x02F4(0x0004) (Edit)
	unsigned long                                      bBlockKarma : 1;                                          // 0x02F4(0x0004) (Edit, Const)
	unsigned long                                      bNetNotify : 1;                                           // 0x02F4(0x0004)
	int                                                CurrentAlpha;                                             // 0x02F8(0x0004) (Edit)
	unsigned long                                      bIgnoreOutOfWorld : 1;                                    // 0x02FC(0x0004)
	unsigned long                                      bBounce : 1;                                              // 0x02FC(0x0004) (Edit)
	unsigned long                                      bFixedRotationDir : 1;                                    // 0x02FC(0x0004) (Edit)
	unsigned long                                      bRotateToDesired : 1;                                     // 0x02FC(0x0004) (Edit)
	unsigned long                                      bInterpolating : 1;                                       // 0x02FC(0x0004)
	unsigned long                                      bJustTeleported : 1;                                      // 0x02FC(0x0004) (Const)
	float                                              Mass;                                                     // 0x0300(0x0004) (Edit)
	float                                              Buoyancy;                                                 // 0x0304(0x0004) (Edit)
	struct FRotator                                    RotationRate;                                             // 0x0308(0x000C) (Edit)
	struct FRotator                                    KayboardRotationRate;                                     // 0x0314(0x000C)
	int                                                KeyboardRotationYawFromServer;                            // 0x0320(0x0004)
	struct FRotator                                    RotationLimit;                                            // 0x0324(0x000C) (Edit)
	struct FRotator                                    DesiredRotation;                                          // 0x0330(0x000C) (Edit)
	class AActor*                                      PendingTouch;                                             // 0x033C(0x0004)
	struct FVector                                     ColLocation;                                              // 0x0340(0x000C) (Const)
	class UKarmaParamsCollision*                       KParams;                                                  // 0x034C(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline)
	int                                                KStepTag;                                                 // 0x0350(0x0004) (Const, Native)
	struct FAnimRep                                    SimAnim;                                                  // 0x0354(0x000C) (Transient)
	TEnumAsByte<EForceType>                            ForceType;                                                // 0x0360(0x0001) (Edit)
	unsigned char                                      UnknownData08[0x3];                                       // 0x0361(0x0003) MISSED OFFSET
	float                                              ForceRadius;                                              // 0x0364(0x0004) (Edit)
	float                                              ForceScale;                                               // 0x0368(0x0004) (Edit)
	unsigned long                                      bNetInitial : 1;                                          // 0x036C(0x0004) (Const)
	unsigned long                                      bNetOwner : 1;                                            // 0x036C(0x0004) (Const)
	unsigned long                                      bNetRelevant : 1;                                         // 0x036C(0x0004) (Const)
	unsigned long                                      bDemoRecording : 1;                                       // 0x036C(0x0004) (Const)
	unsigned long                                      bClientDemoRecording : 1;                                 // 0x036C(0x0004) (Const)
	unsigned long                                      bClientDemoNetFunc : 1;                                   // 0x036C(0x0004) (Const)
	unsigned long                                      bNoRepMesh : 1;                                           // 0x036C(0x0004)
	unsigned long                                      bHiddenEd : 1;                                            // 0x036C(0x0004) (Edit)
	unsigned long                                      bHiddenEdGroup : 1;                                       // 0x036C(0x0004) (Edit)
	unsigned long                                      bDirectional : 1;                                         // 0x036C(0x0004) (Edit)
	unsigned long                                      bSelected : 1;                                            // 0x036C(0x0004) (Const)
	unsigned long                                      bEdShouldSnap : 1;                                        // 0x036C(0x0004) (Edit)
	unsigned long                                      bEdSnap : 1;                                              // 0x036C(0x0004) (Transient)
	unsigned long                                      bTempEditor : 1;                                          // 0x036C(0x0004) (Const, Transient)
	unsigned long                                      bObsolete : 1;                                            // 0x036C(0x0004)
	unsigned long                                      bPathColliding : 1;                                       // 0x036C(0x0004) (Edit)
	unsigned long                                      bPathTemp : 1;                                            // 0x036C(0x0004) (Transient)
	unsigned long                                      bScriptInitialized : 1;                                   // 0x036C(0x0004)
	unsigned long                                      bLockLocation : 1;                                        // 0x036C(0x0004) (Edit)
	unsigned long                                      bLockUndelete : 1;                                        // 0x036C(0x0004) (Edit)
	unsigned long                                      bPlayerPawn : 1;                                          // 0x036C(0x0004)
	unsigned long                                      bTangentLoad : 1;                                         // 0x036C(0x0004) (Transient)
	int                                                nUseNormalmap;                                            // 0x0370(0x0004) (Transient)
	class UClass*                                      MessageClass;                                             // 0x0374(0x0004)
	TArray<class ANSkillProjectile*>                   NSkillProjectileActor;                                    // 0x0378(0x000C) (Transient, NeedCtorLink)
	TArray<class AActor*>                              SpelledNEffectActor;                                      // 0x0384(0x000C) (Transient, NeedCtorLink)
	TArray<class AActor*>                              NProjectileActor;                                         // 0x0390(0x000C) (Transient, NeedCtorLink)
	TEnumAsByte<ENAttackStatus>                        NAttackStatus;                                            // 0x039C(0x0001)
	unsigned char                                      UnknownData09[0x3];                                       // 0x039D(0x0003) MISSED OFFSET
	class AActor*                                      EffectOwner;                                              // 0x03A0(0x0004)
	TEnumAsByte<ESpawnPos>                             SpawnPos;                                                 // 0x03A4(0x0001) (Edit)
	unsigned char                                      UnknownData10[0x3];                                       // 0x03A5(0x0003) MISSED OFFSET
	struct FTextureModifyinfo                          TexModifyInfo;                                            // 0x03A8(0x0010)
	TEnumAsByte<EActorEffectType>                      L2ActorEffecttype;                                        // 0x03B8(0x0001)
	unsigned char                                      UnknownData11[0x3];                                       // 0x03B9(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Actor");
		return ptr;
	}


	void GetEffTargetLocation(struct FVector* LocVector);
	void SetOverlayColor(unsigned char R, unsigned char G, unsigned char B, unsigned char A);
	bool EffectIsRelevant(const struct FVector& SpawnLocation, bool bForceDedicated);
	struct FVector GetCollisionExtent();
	bool CanSplash();
	void PlayTeleportEffect(bool bOut, bool bSound);
	bool IsInPain();
	bool IsInVolume(class AVolume* aVolume);
	void UntriggerEvent(const struct FName& EventName, class AActor* Other, class APawn* EventInstigator);
	void TriggerEvent(const struct FName& EventName, class AActor* Other, class APawn* EventInstigator);
	void Reset();
	void StartInterpolation();
	bool TouchingActor(class AActor* A);
	bool NearSpot(const struct FVector& Spot);
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	struct FString GetDebugName();
	void SetGRI(class AGameReplicationInfo* GRI);
	void MatchStarting();
	struct FString GetLocalString(int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2);
	void SetDefaultDisplayProperties();
	void SetDisplayProperties(TEnumAsByte<ERenderStyle> NewStyle, class UMaterial* NewTexture, bool bLighting);
	void ReplaceText(const struct FString& Replace, const struct FString& With, struct FString* Text);
	struct FString GetHumanReadableName();
	struct FString GetItemName(const struct FString& FullName);
	void BecomeViewTarget();
	void TravelPostAccept();
	void TravelPreAccept();
	void HurtRadius(float DamageAmount, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HitLocation);
	void UpdatePrecacheStaticMeshes();
	void UpdatePrecacheMaterials();
	void PostSetPawnResource();
	void PostNetBeginPlay();
	void SetInitialState();
	void PostBeginPlay();
	void BroadcastLocalizedMessage(class UClass* MessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject);
	void PreBeginPlay();
	void RenderTexture(class UScriptedTexture* Tex);
	void RenderOverlays(class UCanvas* Canvas);
	struct FColor Multiply_ColorFloat(const struct FColor& A, float B);
	struct FColor Add_ColorColor(const struct FColor& A, const struct FColor& B);
	struct FColor Multiply_FloatColor(float A, const struct FColor& B);
	struct FColor Subtract_ColorColor(const struct FColor& A, const struct FColor& B);
	void CollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, class AActor** Actor);
	void VisibleCollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bIgnoreHidden, class AActor** Actor);
	void VisibleActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, class AActor** Actor);
	void RadiusActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, class AActor** Actor);
	void TraceActors(class UClass* BaseClass, const struct FVector& End, const struct FVector& Start, const struct FVector& Extent, class AActor** Actor, struct FVector* HitLoc, struct FVector* HitNorm);
	void TouchingActors(class UClass* BaseClass, class AActor** Actor);
	void BasedActors(class UClass* BaseClass, class AActor** Actor);
	void ChildActors(class UClass* BaseClass, class AActor** Actor);
	void DynamicActors(class UClass* BaseClass, const struct FName& MatchTag, class AActor** Actor);
	void AllActors(class UClass* BaseClass, const struct FName& MatchTag, class AActor** Actor);
	bool MoveCacheEntry(const struct FString& Guid, const struct FString& NewFilename);
	bool GetCacheEntry(int Num, struct FString* Guid, struct FString* Filename);
	void GetNextIntDesc(const struct FString& ClassName, int Num, struct FString* Entry, struct FString* Description);
	struct FString GetNextInt(const struct FString& ClassName, int Num);
	struct FString GetURLMap();
	void GetNextSkin(const struct FString& Prefix, const struct FString& CurrentSkin, int Dir, struct FString* SkinName, struct FString* SkinDesc);
	struct FString GetMapName(const struct FString& NameEnding, const struct FString& MapName, int Dir);
	void BeginPlay();
	void PostTeleport(class ATeleporter* OutTeleporter);
	bool PreTeleport(class ATeleporter* InTeleporter);
	struct FVector SuggestFallVelocity(const struct FVector& Destination, const struct FVector& Start, float MaxZ, float MaxXYSpeed);
	bool PlayerCanSeeMe();
	void MakeNoise(float Loudness);
	float GetSoundDuration(class USound* Sound);
	void StopSound(class USound* a_Sound, float a_StopByFadeOutTime);
	void PlayLoopSound(class USound* Sound, TEnumAsByte<ESoundSlot> Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, float FadeInDuration);
	void PlaySoundOnVehicle(class USound* Sound, TEnumAsByte<ESoundSlot> Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate);
	void DemoPlaySound(class USound* Sound, TEnumAsByte<ESoundSlot> Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate);
	void PlayOwnedSound(class USound* Sound, TEnumAsByte<ESoundSlot> Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate);
	void PlaySound(class USound* Sound, TEnumAsByte<ESoundSlot> Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate);
	void SetTimer(float NewTimerRate, bool bLoop);
	void TornOff();
	bool Destroy();
	class AActor* Spawn(class UClass* SpawnClass, class AActor* SpawnOwner, const struct FName& SpawnTag, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, bool bNoCollisionCheck, bool bNeedMeshContainer);
	bool FastTrace(const struct FVector& TraceEnd, const struct FVector& TraceStart);
	class AActor* Trace(const struct FVector& TraceEnd, const struct FVector& TraceStart, bool bTraceActors, const struct FVector& Extent, struct FVector* HitLocation, struct FVector* HitNormal, class UMaterial** Material);
	void TakeDamage(int Damage, class APawn* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType);
	void KilledBy(class APawn* EventInstigator);
	void FellOutOfWorld(TEnumAsByte<EeKillZType> KillType);
	void UsedBy(class APawn* User);
	void EndedRotation();
	void FinishedInterpolation();
	void EncroachedBy(class AActor* Other);
	bool EncroachingOn(class AActor* Other);
	class AActor* SpecialHandling(class APawn* Other);
	void Detach(class AActor* Other);
	void Attach(class AActor* Other);
	void BaseChange();
	void Bump(class AActor* Other);
	void UnTouch(class AActor* Other);
	void PostTouch(class AActor* Other);
	void Touch(class AActor* Other);
	void PhysicsVolumeChange(class APhysicsVolume* NewVolume);
	void ZoneChange(class AZoneInfo* NewZone);
	void Landed(const struct FVector& HitNormal);
	void Falling();
	void HitWall(const struct FVector& HitNormal, class AActor* HitWall);
	void Timer();
	void EndEvent();
	void BeginEvent();
	void UnTrigger(class AActor* Other, class APawn* EventInstigator);
	void Trigger(class AActor* Other, class APawn* EventInstigator);
	void PostNetReceive();
	void Tick(float DeltaTime);
	void LostChild(class AActor* Other);
	void GainedChild(class AActor* Other);
	void Destroyed();
	void SetAlphaTexModifier(int a_Alpha);
	void SetActorViewType(TEnumAsByte<EActorViewType> a_ActorViewType);
	bool NDestroy();
	void StopAllMusic(float FadeOutTime);
	void StopMusic(int SongHandle, float FadeOutTime);
	int PlayMusic(const struct FString& Song, float FadeInTime);
	void UnClock(float* Time);
	void Clock(float* Time);
	bool KUpdateState(struct FKRigidBodyState* NewState);
	void KApplyForce(struct FVector* Force, struct FVector* Torque);
	void KSkelConvulse();
	void KVelDropBelow();
	void KImpact(class AActor* Other, const struct FVector& pos, const struct FVector& impactVel, const struct FVector& impactNorm);
	bool KIsRagdollAvailable();
	void KMakeRagdollAvailable();
	void KRemoveAllBoneLifters();
	void KRemoveLifterFromBone(const struct FName& bonename);
	void KAddBoneLifter(const struct FName& bonename, const struct FInterpCurve& LiftVel, float LateralFriction, const struct FInterpCurve& Softness);
	void KFreezeRagdoll();
	float KGetSkelMass();
	void KSetSkelVel(const struct FVector& Velocity, const struct FVector& AngVelocity, bool AddToCurrent);
	void KEnableCollision(class AActor* Other);
	void KDisableCollision(class AActor* Other);
	float KGetActorGravScale();
	void KSetActorGravScale(float ActorGravScale);
	void KSetBlockKarma(bool newBlock);
	void KSetStayUpright(bool stayUpright, bool allowRotate);
	void KAddImpulse(const struct FVector& Impulse, const struct FVector& Position, const struct FName& bonename);
	bool KIsAwake();
	void KWake();
	float KGetImpactThreshold();
	void KSetImpactThreshold(float thresh);
	void KGetCOMPosition(struct FVector* pos);
	void KGetCOMOffset(struct FVector* offset);
	void KSetCOMOffset(const struct FVector& offset);
	float KGetRestitution();
	void KSetRestitution(float rest);
	float KGetFriction();
	void KSetFriction(float friction);
	void KGetDampingProps(float* lindamp, float* angdamp);
	void KSetDampingProps(float lindamp, float angdamp);
	void KGetInertiaTensor(struct FVector* it1, struct FVector* it2);
	void KSetInertiaTensor(const struct FVector& it1, const struct FVector& it2);
	float KGetMass();
	void KSetMass(float Mass);
	struct FKRBVec KRBVecFromVector(const struct FVector& V);
	struct FVector KRBVecToVector(const struct FKRBVec& RBvec);
	void KDrawRigidBodyState(const struct FKRigidBodyState& RBstate, bool AltColour);
	void KGetRigidBodyState(struct FKRigidBodyState* RBstate);
	struct FQuat KGetRBQuaternion();
	void OnlyAffectPawns(bool B);
	void SetPhysics(TEnumAsByte<EPhysics> newPhysics);
	void FinishInterpolation();
	void DebugUnclock();
	void DebugClock();
	void DrawDebugLine(const struct FVector& LineStart, const struct FVector& LineEnd, unsigned char R, unsigned char G, unsigned char B);
	struct FPlane GetRenderBoundingSphere();
	bool AnimIsInGroup(int Channel, const struct FName& GroupName);
	void GetAnimParams(int Channel, struct FName* OutSeqName, float* OutAnimFrame, float* OutAnimRate);
	void SetBoneRotation(const struct FName& bonename, const struct FRotator& BoneTurn, int Space, float Alpha);
	void SetBoneLocation(const struct FName& bonename, const struct FVector& BoneTrans, float Alpha);
	void SetBoneDirection(const struct FName& bonename, const struct FRotator& BoneTurn, const struct FVector& BoneTrans, float Alpha, int Space);
	void SetBoneScale(int Slot, float BoneScale, const struct FName& bonename);
	void LockRootMotion(int Lock);
	bool AttachToBoneWithIndex(class AActor* Attachment, int BoneIndex);
	bool DetachFromBone(class AActor* Attachment);
	bool AttachToBone(class AActor* Attachment, const struct FName& bonename, int type);
	struct FRotator GetRootRotationDelta();
	struct FVector GetRootLocationDelta();
	struct FRotator GetRootRotation();
	struct FVector GetRootLocation();
	struct FCoords GetBoneCoordsWithBoneIndex(int BoneIndex);
	struct FRotator GetBoneRotation(const struct FName& bonename, int Space);
	struct FCoords GetBoneCoords(const struct FName& bonename);
	void AnimBlendToAlpha(int Stage, float TargetAlpha, float TimeInterval);
	void AnimBlendParams(int Stage, float BlendAlpha, float InTime, float OutTime, const struct FName& bonename, bool bGlobalPose);
	void BoneRefresh();
	void LinkMesh(class UMesh* NewMesh, bool bKeepAnim);
	void LinkSkelAnim(class UMeshAnimation* Anim, class UMesh* NewMesh);
	int GetNotifyChannel();
	void EnableChannelNotify(int Channel, int Switch);
	void AnimEnd(int Channel);
	void ClearL2Game();
	void L2GameActionNotify(TEnumAsByte<EL2GameAction> GameAction);
	bool IsTweening(int Channel);
	void SetAnimFrame(float Time, int Channel, int UnitFlag);
	void FreezeAnimAt(float Time, int Channel);
	bool HasBoneName(const struct FName& bonename);
	void StopAnimating(bool ClearAllButBase);
	bool HasAnim(const struct FName& Sequence);
	void FinishAnim(int Channel);
	bool IsAnimating(int Channel);
	void TweenAnim(const struct FName& Sequence, float Time, int Channel);
	void LoopAnim(const struct FName& Sequence, float Rate, float TweenTime, int Channel);
	void PlayAnim(const struct FName& Sequence, float Rate, float TweenTime, int Channel);
	struct FString GetMeshName();
	void SetOwner(class AActor* NewOwner);
	void SetBase(class AActor* NewBase, const struct FVector& NewFloor);
	void AutonomousPhysics(float DeltaSeconds);
	bool MoveSmooth(const struct FVector& Delta);
	bool SetRelativeLocation(const struct FVector& NewLocation);
	bool SetRelativeRotation(const struct FRotator& NewRotation);
	bool SetRotation(const struct FRotator& NewRotation);
	bool SetLocation(const struct FVector& NewLocation, bool bNoCheck);
	bool Move(const struct FVector& Delta);
	void SetDrawType(TEnumAsByte<EDrawType> NewDrawType);
	void SetStaticMesh(class UStaticMesh* NewStaticMesh);
	void SetDrawScale3D(const struct FVector& NewScale3D);
	void SetDrawScale(float NewScale);
	bool SetCollisionSize(float NewRadius, float NewHeight);
	void SetCollision(bool NewColActors, bool NewBlockActors, bool NewBlockPlayers);
	void Sleep(float Seconds);
	void Error(const struct FString& S);
	class UViewport* GetViewport();
	struct FString ConsoleCommand(const struct FString& Command);
};

