#pragma once

// Lineage 2 (Gracia Final) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace L2_SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Interface.UICommonAPI
// 0x0000 (0x003C - 0x003C)
class UUICommonAPI : public UUIScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.UICommonAPI");
		return ptr;
	}


	struct FString STATIC_GetPrimeItemSymbolName();
	bool STATIC_IsAdena(const struct FItemID& Id);
	bool STATIC_IsSameServerID(const struct FItemID& src, const struct FItemID& des);
	bool STATIC_IsSameClassID(const struct FItemID& src, const struct FItemID& des);
	bool STATIC_IsSameItemID(const struct FItemID& src, const struct FItemID& des);
	void STATIC_ClearItemID(struct FItemID* Id);
	void STATIC_ParamAddItemIDWithIndex(const struct FItemID& Id, int idx, struct FString* param);
	void STATIC_ParamAddItemID(const struct FItemID& Id, struct FString* param);
	bool STATIC_ParseItemIDWithIndex(const struct FString& param, int idx, struct FItemID* Id);
	bool STATIC_ParseItemID(const struct FString& param, struct FItemID* Id);
	struct FItemID STATIC_GetItemID(int Id);
	bool STATIC_IsValidItemID(const struct FItemID& Id);
	struct FCustomTooltip STATIC_MakeTooltipSimpleText(const struct FString& Text);
	void STATIC_ParamToRecord(const struct FString& param, struct FLVDataRecord* Record);
	void STATIC_ParamToItemInfo(const struct FString& param, struct FItemInfo* Info);
	bool STATIC_IsShowWindow(const struct FString& a_ControlID);
	void STATIC_HideWindow(const struct FString& a_ControlID);
	void STATIC_ShowWindowWithFocus(const struct FString& a_ControlID);
	void STATIC_ShowWindow(const struct FString& a_ControlID);
	int STATIC_Split(const struct FString& strInput, const struct FString& delim, TArray<struct FString>* arrToken);
	void STATIC_DialogSetEditBoxMaxLength(int maxLength);
	void STATIC_DialogGetReservedItemInfo(struct FItemInfo* Info);
	struct FItemID STATIC_DialogGetReservedItemID();
	int STATIC_DialogGetReservedInt3();
	struct FINT64 STATIC_DialogGetReservedInt2();
	int STATIC_DialogGetReservedInt();
	void STATIC_DialogSetReservedItemInfo(const struct FItemInfo& Info);
	void STATIC_DialogSetReservedItemID(const struct FItemID& Id);
	void STATIC_DialogSetReservedInt3(int Value);
	void STATIC_DialogSetReservedInt2(const struct FINT64& Value);
	void STATIC_DialogSetReservedInt(int Value);
	void STATIC_DialogSetParamInt64(const struct FINT64& param);
	int STATIC_DialogGetID();
	void STATIC_DialogSetString(const struct FString& strInput);
	struct FString STATIC_DialogGetString();
	void STATIC_DialogSetEditType(const struct FString& strType);
	void STATIC_DialogSetID(int Id);
	bool STATIC_DialogIsMine();
	void STATIC_DialogSetDefaultOK();
	void STATIC_DialogHide();
	void STATIC_DialogShow(TEnumAsByte<EDialogType> dialogType, const struct FString& strMessage);
};


// Class Interface.ToolTip
// 0x007C (0x00B8 - 0x003C)
class UToolTip : public UUICommonAPI
{
public:
	struct FCustomTooltip                              m_Tooltip;                                                // 0x003C(0x0014) (NeedCtorLink)
	struct FDrawItemInfo                               m_Info;                                                   // 0x0050(0x0058) (NeedCtorLink)
	int                                                NowAttrLv;                                                // 0x00A8(0x0004)
	int                                                NowMaxValue;                                              // 0x00AC(0x0004)
	int                                                NowValue;                                                 // 0x00B0(0x0004)
	int                                                NowType;                                                  // 0x00B4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.ToolTip");
		return ptr;
	}


	void STATIC_AddPrimeItemSymbol(const struct FItemInfo& item);
	void STATIC_GetDefAttrLv(int DefValue);
	void STATIC_GetAttAttrLv(int AttValue);
	void STATIC_AddTooltipItemQuestList(const struct FItemInfo& item);
	void STATIC_AddTooltipItemAttributeGage(const struct FItemInfo& item);
	void STATIC_GetRefineryColor(int Quality, int* R, int* G, int* B);
	void STATIC_AddTooltipItemCount(const struct FItemInfo& item);
	void STATIC_AddTooltipItemGrade(const struct FItemInfo& item);
	void STATIC_AddTooltipItemName(const struct FString& Name, const struct FItemInfo& item, int AddTooltipItemName);
	void STATIC_AddTooltipItemEnchant(const struct FItemInfo& item);
	void STATIC_AddTooltipItemBlank(int Height);
	void STATIC_SetTooltipItemColor(int R, int G, int B, int offset);
	void STATIC_AddTooltipItemOption2(int TitleID, int ContentID, bool bTitle, bool bContent, bool IamFirst);
	void STATIC_AddTooltipItemOption(int TitleID, const struct FString& Content, bool bTitle, bool bContent, bool IamFirst);
	void STATIC_ReturnTooltip_NTT_MANOR(const struct FString& param, const struct FString& TooltipType, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_QUESTINFO(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_RAIDLIST(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_QUESTLIST(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_PARTYMATCH(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_CLANINFO(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_RECIPE_MANUFACTURE(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_SHORTCUT(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_RECIPE(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType, bool bShowPrice);
	void STATIC_ReturnTooltip_NTT_NORMALITEM(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_ABNORMALSTATUS(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_SKILL(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_ACTION(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_ITEM(const struct FString& param, const struct FString& TooltipType, TEnumAsByte<ETooltipSourceType> eSourceType);
	void STATIC_ReturnTooltip_NTT_TEXT(const struct FString& param, TEnumAsByte<ETooltipSourceType> eSourceType, bool bDesc);
	void STATIC_EndItem();
	void STATIC_StartItem();
	void STATIC_ClearTooltip();
	bool STATIC_IsEnchantableItem(TEnumAsByte<EItemParamType> type);
	void STATIC_HandleRequestTooltipInfo(const struct FString& param);
	void STATIC_OnEvent(int Event_ID, const struct FString& param);
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.MiniGame1Wnd
// 0x0D88 (0x0DC4 - 0x003C)
class UMiniGame1Wnd : public UUIScript
{
public:
	struct FMG1CellData                                CellGridData[0x40];                                       // 0x003C(0x0028) (NeedCtorLink)
	class UWindowHandle*                               Me;                                                       // 0x0A3C(0x0004)
	class UTextureHandle*                              MGTex0[0x8];                                              // 0x0A40(0x0004)
	class UTextureHandle*                              MGTex1[0x8];                                              // 0x0A60(0x0004)
	class UTextureHandle*                              MGTex2[0x8];                                              // 0x0A80(0x0004)
	class UTextureHandle*                              MGTex3[0x8];                                              // 0x0AA0(0x0004)
	class UTextureHandle*                              MGTex4[0x8];                                              // 0x0AC0(0x0004)
	class UTextureHandle*                              MGTex5[0x8];                                              // 0x0AE0(0x0004)
	class UTextureHandle*                              MGTex6[0x8];                                              // 0x0B00(0x0004)
	class UTextureHandle*                              MGTex7[0x8];                                              // 0x0B20(0x0004)
	class UButtonHandle*                               MGBtn0[0x8];                                              // 0x0B40(0x0004)
	class UButtonHandle*                               MGBtn1[0x8];                                              // 0x0B60(0x0004)
	class UButtonHandle*                               MGBtn2[0x8];                                              // 0x0B80(0x0004)
	class UButtonHandle*                               MGBtn3[0x8];                                              // 0x0BA0(0x0004)
	class UButtonHandle*                               MGBtn4[0x8];                                              // 0x0BC0(0x0004)
	class UButtonHandle*                               MGBtn5[0x8];                                              // 0x0BE0(0x0004)
	class UButtonHandle*                               MGBtn6[0x8];                                              // 0x0C00(0x0004)
	class UButtonHandle*                               MGBtn7[0x8];                                              // 0x0C20(0x0004)
	class UAnimTextureHandle*                          MGAnim0[0x8];                                             // 0x0C40(0x0004)
	class UAnimTextureHandle*                          MGAnim1[0x8];                                             // 0x0C60(0x0004)
	class UAnimTextureHandle*                          MGAnim2[0x8];                                             // 0x0C80(0x0004)
	class UAnimTextureHandle*                          MGAnim3[0x8];                                             // 0x0CA0(0x0004)
	class UAnimTextureHandle*                          MGAnim4[0x8];                                             // 0x0CC0(0x0004)
	class UAnimTextureHandle*                          MGAnim5[0x8];                                             // 0x0CE0(0x0004)
	class UAnimTextureHandle*                          MGAnim6[0x8];                                             // 0x0D00(0x0004)
	class UAnimTextureHandle*                          MGAnim7[0x8];                                             // 0x0D20(0x0004)
	class UButtonHandle*                               MG_BTNChallenge;                                          // 0x0D40(0x0004)
	class UButtonHandle*                               MG_BTNClose;                                              // 0x0D44(0x0004)
	class UProgressCtrlHandle*                         ProgressBar;                                              // 0x0D48(0x0004)
	class UTextureHandle*                              ResultTex;                                                // 0x0D4C(0x0004)
	struct FString                                     tX[0x6];                                                  // 0x0D50(0x000C) (NeedCtorLink)
	unsigned long                                      m_InGamingBool : 1;                                       // 0x0D98(0x0004)
	unsigned long                                      m_IsNewGamingBool : 1;                                    // 0x0D98(0x0004)
	unsigned long                                      m_PauseBool : 1;                                          // 0x0D98(0x0004)
	int                                                m_MatchCount;                                             // 0x0D9C(0x0004)
	int                                                m_CellBtnStatus;                                          // 0x0DA0(0x0004)
	int                                                m_CellBtnID1;                                             // 0x0DA4(0x0004)
	int                                                m_CellBtnID2;                                             // 0x0DA8(0x0004)
	int                                                m_CurrentLevel;                                           // 0x0DAC(0x0004)
	int                                                m_CurrentTimer;                                           // 0x0DB0(0x0004)
	int                                                m_CurrentScore;                                           // 0x0DB4(0x0004)
	int                                                m_TargetScore;                                            // 0x0DB8(0x0004)
	int                                                m_CountNumberofChains;                                    // 0x0DBC(0x0004)
	int                                                m_CurrentAnimID;                                          // 0x0DC0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.MiniGame1Wnd");
		return ptr;
	}


	struct FString STATIC_TrimRight(const struct FString& S);
	void STATIC_PutNumberScore(int LevelNo);
	void STATIC_PutNumberLevel(int LevelNo);
	void STATIC_ProcEndGameDefaultSetting(const struct FString& SetTextureName);
	void STATIC_EndGamewithTimeOut();
	void EndGame();
	void STATIC_StartLevelUp();
	void STATIC_EndGameRemoveBlock(int Id);
	int STATIC_GetTargetScore(int CurrentLevel);
	int STATIC_GetCurrentTimeLimit(int CurrentLevel);
	void STATIC_OnTextureAnimEnd(class UAnimTextureHandle* a_WindowHandle);
	void STATIC_OnProgressTimeUp(const struct FString& strID);
	int STATIC_GetCellGridID(int X, int Y);
	bool STATIC_CheckSwappable(int ID1, int ID2);
	bool STATIC_CheckMovesOnTimer();
	void STATIC_OnTimer(int TimerID);
	void STATIC_OnClickCellIcon(int X, int Y);
	void STATIC_OnTimeOver();
	void STATIC_RestartCurrentGame();
	void STATIC_StartNewGameProc();
	void STATIC_StartNewGame();
	void STATIC_OnHide();
	void STATIC_PauseGame();
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_CheckMatches(bool ClearButton);
	void STATIC_Randomize(int Id);
	void Initialize();
	void STATIC_PushDownRow(int Id);
	void STATIC_CheckMoves();
	void STATIC_CountMatches();
	void STATIC_ClearCellGridDataFlag();
	void STATIC_MoveTillnoMatches();
	void STATIC_ReadyCells();
	void STATIC_OnShow();
	void STATIC_ClearCellGridData();
	void STATIC_ClearScoreData();
	void STATIC_OnEvent(int EvID, const struct FString& param);
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.SSQMainBoard
// 0x0090 (0x00CC - 0x003C)
class USSQMainBoard : public UUIScript
{
public:
	struct FSSQStatusInfo                              g_sinfo;                                                  // 0x003C(0x0060)
	struct FSSQPreStatusInfo                           g_sinfopre;                                               // 0x009C(0x002C) (NeedCtorLink)
	unsigned long                                      m_bShowPreInfo : 1;                                       // 0x00C8(0x0004)
	unsigned long                                      m_bRequest_SealStatus : 1;                                // 0x00C8(0x0004)
	unsigned long                                      m_bRequest_MainEvent : 1;                                 // 0x00C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.SSQMainBoard");
		return ptr;
	}


	struct FString STATIC_GetSSQTimeAttackEventRoomName(int nID);
	struct FString STATIC_GetSSQSealDesc(int nID);
	struct FString STATIC_GetSSQTeamName(int nID);
	struct FString STATIC_GetSSQSealName(int nID);
	void STATIC_AddSSQSealStatus(int m_nSSQStatus, int m_nNeedPoint1, int m_nNeedPoint2, int m_nSealID, int m_nOwnerTeamID, int m_nTeam1Mark, int m_nTeam2Mark);
	void STATIC_ShowSSQSealStatus();
	void STATIC_AddSSQMainEvent(const struct FSSQMainEventInfo& Info);
	void STATIC_ShowSSQMainEvent();
	void STATIC_ClearSSQMainEventInfo(struct FSSQMainEventInfo* Info);
	void STATIC_AddSSQPreInfoSealStatus();
	void STATIC_SetSSQPreInfo();
	void STATIC_ClearSSQPreInfo();
	void STATIC_SetSSQStatusInfo();
	void STATIC_SetSSQStatus();
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_OnEvent(int Event_ID, const struct FString& param);
	void STATIC_OnHide();
	void STATIC_OnShow();
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.ChatWnd
// 0x0110 (0x014C - 0x003C)
class UChatWnd : public UUICommonAPI
{
public:
	int                                                m_NoUnionCommanderMessage;                                // 0x003C(0x0004)
	int                                                m_KeywordFilterSound;                                     // 0x0040(0x0004)
	int                                                m_KeywordFilterActivate;                                  // 0x0044(0x0004)
	struct FString                                     m_Keyword0;                                               // 0x0048(0x000C) (NeedCtorLink)
	struct FString                                     m_Keyword1;                                               // 0x0054(0x000C) (NeedCtorLink)
	struct FString                                     m_Keyword2;                                               // 0x0060(0x000C) (NeedCtorLink)
	TArray<struct FChatFilterInfo>                     m_filterInfo;                                             // 0x006C(0x000C) (NeedCtorLink)
	TArray<struct FString>                             m_sectionName;                                            // 0x0078(0x000C) (NeedCtorLink)
	struct FChatUIType                                 m_ChatUI[0x8];                                            // 0x0084(0x0008)
	struct FChatUIType                                 m_chatType;                                               // 0x00C4(0x0008)
	class UChatWindowHandle*                           NormalChat;                                               // 0x00CC(0x0004)
	class UChatWindowHandle*                           TradeChat;                                                // 0x00D0(0x0004)
	class UChatWindowHandle*                           PartyChat;                                                // 0x00D4(0x0004)
	class UChatWindowHandle*                           ClanChat;                                                 // 0x00D8(0x0004)
	class UChatWindowHandle*                           AllyChat;                                                 // 0x00DC(0x0004)
	class UChatWindowHandle*                           SystemMsg;                                                // 0x00E0(0x0004)
	class UTabHandle*                                  ChatTabCtrl;                                              // 0x00E4(0x0004)
	class UEditBoxHandle*                              ChatEditBox;                                              // 0x00E8(0x0004)
	class UWindowHandle*                               m_hChatWnd;                                               // 0x00EC(0x0004)
	class UWindowHandle*                               m_hSystemMsgWnd;                                          // 0x00F0(0x0004)
	class UWindowHandle*                               m_hChatFilterWnd;                                         // 0x00F4(0x0004)
	class UTextureHandle*                              m_hChatWndLanguageTexture;                                // 0x00F8(0x0004)
	class UCheckBoxHandle*                             m_hChatFilterWndSystemMsgBox;                             // 0x00FC(0x0004)
	class UCheckBoxHandle*                             m_hChatFilterWndDamageBox;                                // 0x0100(0x0004)
	class UCheckBoxHandle*                             m_hChatFilterWndItemBox;                                  // 0x0104(0x0004)
	class UTextBoxHandle*                              m_hChatFilterWndCurrentText;                              // 0x0108(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxCommand;                       // 0x010C(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndKeywordSoundBox;                       // 0x0110(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndKeywordFilterBox;                      // 0x0114(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxSystem;                        // 0x0118(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxNormal;                        // 0x011C(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxShout;                         // 0x0120(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxPledge;                        // 0x0124(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxParty;                         // 0x0128(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxTrade;                         // 0x012C(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxWhisper;                       // 0x0130(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxDamage;                        // 0x0134(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxAlly;                          // 0x0138(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxItem;                          // 0x013C(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxHero;                          // 0x0140(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxUnion;                         // 0x0144(0x0004)
	class UCheckBoxHandle*                             m_hChkChatFilterWndCheckBoxBattleField;                   // 0x0148(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.ChatWnd");
		return ptr;
	}


	int STATIC_GetCurrentChatTypeID(int ChatTypeUI);
	void STATIC_AssignCurrentChatTypeID(int ChatTypeID, int ChatTypeUI);
	void STATIC_GetAllcurrentAssignedChatTypeID();
	void STATIC_SetCurrentAssignedChatType2Ini(int ChannelIndex, int ChatType);
	void STATIC_ChangeTabChannel(int ChannelIndex);
	void STATIC_HandleDominionWarChannelSet(const struct FString& param);
	void STATIC_HandleTextLinkLButtonClick(const struct FString& param);
	TEnumAsByte<EChatType> STATIC_GetChatTypeByTabIndex(int Index);
	void STATIC_HandleMsnStatus(const struct FString& param);
	void STATIC_Print(int Index);
	void STATIC_HandleSetFocus();
	void STATIC_HandleSetString(const struct FString& a_Param);
	void STATIC_HandleChatWndStatusChange();
	void STATIC_SetChatFilterButton();
	void STATIC_SetDefaultFilterValue();
	void STATIC_SetDefaultFilterOn();
	void STATIC_InitFilterInfo();
	bool STATIC_CheckFilter(TEnumAsByte<EChatType> type, int WindowType, TEnumAsByte<ESystemMsgType> systemType);
	void STATIC_HandleIMEStatusChange();
	void STATIC_ShowAnnounceMessgage(const struct FString& Msg);
	void STATIC_ShowUnionCommanderMessgage(const struct FString& Msg);
	void STATIC_HandleChatmessage(const struct FString& param);
	void STATIC_HandleChatWndMacroCommand(const struct FString& param);
	void STATIC_OnEvent(int Event_ID, const struct FString& param);
	void STATIC_OnEnterState(const struct FName& a_PrevStateName);
	void STATIC_HandleTabClick(const struct FString& strID);
	void STATIC_OnTabMerge(const struct FString& sTabButton);
	void STATIC_OnTabSplit(const struct FString& sTabButton);
	void STATIC_OnTimer(int TimerID);
	void STATIC_ClosePartyMatchingWnd();
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_OnShow();
	void Clear();
	void STATIC_OnCompleteEditBox(const struct FString& strID);
	void STATIC_InitScrollBarPosition();
	void STATIC_InitHandleCOD();
	void STATIC_InitHandle();
	void STATIC_InitGlobalSetting();
	void STATIC_OnDefaultPosition();
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.ClanWnd
// 0x00D0 (0x010C - 0x003C)
class UClanWnd : public UUIScript
{
public:
	int                                                m_clanID;                                                 // 0x003C(0x0004)
	struct FString                                     m_clanName;                                               // 0x0040(0x000C) (NeedCtorLink)
	int                                                m_clanRank;                                               // 0x004C(0x0004)
	int                                                m_clanLevel;                                              // 0x0050(0x0004)
	int                                                m_clanNameValue;                                          // 0x0054(0x0004)
	int                                                m_bMoreInfo;                                              // 0x0058(0x0004)
	int                                                m_currentShowIndex;                                       // 0x005C(0x0004)
	int                                                G_CurrentRecord;                                          // 0x0060(0x0004)
	struct FString                                     G_CurrentSzData;                                          // 0x0064(0x000C) (NeedCtorLink)
	unsigned long                                      G_CurrentAlias : 1;                                       // 0x0070(0x0004)
	unsigned long                                      G_IamNobless : 1;                                         // 0x0070(0x0004)
	unsigned long                                      G_IamHero : 1;                                            // 0x0070(0x0004)
	int                                                G_ClanMember;                                             // 0x0074(0x0004)
	struct FString                                     m_WindowName;                                             // 0x0078(0x000C) (NeedCtorLink)
	int                                                m_myClanType;                                             // 0x0084(0x0004)
	struct FString                                     m_myName;                                                 // 0x0088(0x000C) (NeedCtorLink)
	struct FString                                     m_myClanName;                                             // 0x0094(0x000C) (NeedCtorLink)
	int                                                m_indexNum;                                               // 0x00A0(0x0004)
	unsigned long                                      m_currentactivestatus1 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus2 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus3 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus4 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus5 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus6 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus7 : 1;                               // 0x00A4(0x0004)
	unsigned long                                      m_currentactivestatus8 : 1;                               // 0x00A4(0x0004)
	int                                                m_bClanMaster;                                            // 0x00A8(0x0004)
	int                                                m_bJoin;                                                  // 0x00AC(0x0004)
	int                                                m_bNickName;                                              // 0x00B0(0x0004)
	int                                                m_bCrest;                                                 // 0x00B4(0x0004)
	int                                                m_bWar;                                                   // 0x00B8(0x0004)
	int                                                m_bGrade;                                                 // 0x00BC(0x0004)
	int                                                m_bManageMaster;                                          // 0x00C0(0x0004)
	int                                                m_bOustMember;                                            // 0x00C4(0x0004)
	class UTextBoxHandle*                              txtDominionWarTitle;                                      // 0x00C8(0x0004)
	class UTextBoxHandle*                              txtDominionWarStatus;                                     // 0x00CC(0x0004)
	class UTextBoxHandle*                              TxtDominionWar_Title;                                     // 0x00D0(0x0004)
	class UTextBoxHandle*                              TxtDominion;                                              // 0x00D4(0x0004)
	class UTextBoxHandle*                              TxtDominionWarStatusTitle;                                // 0x00D8(0x0004)
	class UTextBoxHandle*                              TxtClanWar_Title;                                         // 0x00DC(0x0004)
	class UListCtrlHandle*                             m_hClanMemberList;                                        // 0x00E0(0x0004)
	struct FString                                     m_CurrentclanMasterName;                                  // 0x00E4(0x000C) (NeedCtorLink)
	struct FString                                     m_CurrentclanMasterReal;                                  // 0x00F0(0x000C) (NeedCtorLink)
	int                                                m_CurrentNHType;                                          // 0x00FC(0x0004)
	TArray<struct FClanInfo>                           m_memberList;                                             // 0x0100(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.ClanWnd");
		return ptr;
	}


	void STATIC_ResetOpeningVariables();
	void STATIC_HandleClanMyAuth(const struct FString& a_Param);
	void STATIC_AskJoin();
	void STATIC_HandleSubClanUpdated(const struct FString& a_Param);
	void STATIC_RefreshCombobox();
	void STATIC_HandleDeleteMember(const struct FString& a_Param);
	int STATIC_GetIndexFromType(int type);
	void STATIC_HandleAddClanMember(const struct FString& a_Param);
	void STATIC_RefreshCombobox1(int ClanT);
	void STATIC_HandleMemberInfoUpdate(const struct FString& a_Param);
	bool STATIC_GetSelectedListCtrlItem(struct FLVDataRecord* Record);
	void STATIC_AddToList(int idx);
	int STATIC_getClanKnighthoodMasterInfo(const struct FString& NameVal);
	void STATIC_ShowList(int clanType);
	void STATIC_ClearList();
	void STATIC_HandleAddClanMemberMultiple(const struct FString& a_Param);
	void STATIC_HandleClanInfoUpdate(const struct FString& a_Param);
	void STATIC_HandleClanInfo(const struct FString& a_Param);
	void STATIC_HandleEV_ResultJoinDominionWar();
	void Clear();
	void STATIC_resetBtnShowHide();
	void STATIC_OnDBClickListCtrlRecord(const struct FString& ListCtrlID);
	void STATIC_OnClickListCtrlRecord(const struct FString& ListCtrlID);
	void STATIC_OnComboBoxItemSelected(const struct FString& sName, int Index);
	void STATIC_OnEvent(int a_EventID, const struct FString& a_Param);
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_OnEnterState(const struct FName& a_PreStateName);
	void STATIC_OnHide();
	void STATIC_NoblessMenuValidate();
	void STATIC_OnShow();
	struct FString STATIC_GetClanTypeNameFromIndex(int Index);
	int STATIC_GetClanTypeFromIndex(int Index);
	void STATIC_OnRegisterEvent();
	void STATIC_Load();
	void STATIC_InitHandleCOD();
	void STATIC_InitHandle();
	void STATIC_OnLoad();
	int STATIC_findmyClanData(const struct FString& C_Name);
	void STATIC_getmyClanInfo();
};


// Class Interface.InventoryWnd
// 0x010C (0x0148 - 0x003C)
class UInventoryWnd : public UUICommonAPI
{
public:
	class UWindowHandle*                               m_hInventoryWnd;                                          // 0x003C(0x0004)
	struct FString                                     m_WindowName;                                             // 0x0040(0x000C) (NeedCtorLink)
	class UItemWindowHandle*                           m_invenItem;                                              // 0x004C(0x0004)
	class UItemWindowHandle*                           m_questItem;                                              // 0x0050(0x0004)
	class UItemWindowHandle*                           m_equipItem[0x19];                                        // 0x0054(0x0004)
	class UItemWindowHandle*                           m_hHennaItemWindow;                                       // 0x00B8(0x0004)
	class UTextBoxHandle*                              m_hAdenaTextBox;                                          // 0x00BC(0x0004)
	class UTabHandle*                                  m_invenTab;                                               // 0x00C0(0x0004)
	class UButtonHandle*                               m_sortBtn;                                                // 0x00C4(0x0004)
	class UButtonHandle*                               m_BtnRotateLeft;                                          // 0x00C8(0x0004)
	class UButtonHandle*                               m_BtnRotateRight;                                         // 0x00CC(0x0004)
	class UTextureHandle*                              m_CloakSlot_Disable;                                      // 0x00D0(0x0004)
	class UTextureHandle*                              m_Talisman_Disable[0x6];                                  // 0x00D4(0x0004)
	class UCharacterViewportWindowHandle*              m_ObjectViewport;                                         // 0x00EC(0x0004)
	TArray<struct FItemID>                             m_itemOrder;                                              // 0x00F0(0x000C) (NeedCtorLink)
	struct FVector                                     m_clickLocation;                                          // 0x00FC(0x000C)
	TArray<struct FItemInfo>                           m_EarItemList;                                            // 0x0108(0x000C) (NeedCtorLink)
	TArray<struct FItemInfo>                           m_FingerItemLIst;                                         // 0x0114(0x000C) (NeedCtorLink)
	TArray<struct FItemInfo>                           m_DecoItemList;                                           // 0x0120(0x000C) (NeedCtorLink)
	int                                                m_invenCount;                                             // 0x012C(0x0004)
	unsigned long                                      m_bCurrentState : 1;                                      // 0x0130(0x0004)
	int                                                m_MaxInvenCount;                                          // 0x0134(0x0004)
	int                                                m_MeshType;                                               // 0x0138(0x0004)
	int                                                m_NpcID;                                                  // 0x013C(0x0004)
	class UButtonHandle*                               m_hBtnCrystallize;                                        // 0x0140(0x0004)
	class UWindowHandle*                               ColorNickNameWnd;                                         // 0x0144(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.InventoryWnd");
		return ptr;
	}


	void STATIC_HandleChangeCharacterPawn(const struct FString& param);
	void STATIC_HandleSetMaxCount(const struct FString& param);
	void STATIC_UpdateCloakSlotActivation();
	void STATIC_UpdateTalismanSlotActivation();
	void STATIC_SortItem(class UItemWindowHandle* ItemWnd);
	void STATIC_OnLButtonUp(class UWindowHandle* a_WindowHandle, int X, int Y);
	void STATIC_OnLButtonDown(class UWindowHandle* a_WindowHandle, int X, int Y);
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_SaveInventoryOrder();
	void STATIC_InvenClear();
	void STATIC_InvenDelete(const struct FItemInfo& item);
	void STATIC_InvenAddItem(const struct FItemInfo& NewItem, int ORDER);
	void STATIC_InvenLimitUpdate();
	bool STATIC_IsArrow(const struct FItemInfo& a_Info);
	int STATIC_IsDecoItem(const struct FItemInfo& a_Info);
	bool STATIC_IsBowOrFishingRod(const struct FItemInfo& a_Info);
	int STATIC_IsLOrRFinger(const struct FItemID& sID);
	int STATIC_IsLOrREar(const struct FItemID& sID);
	bool STATIC_IsShowInventoryWndUponEvent();
	void STATIC_HandleToggleWindow();
	void STATIC_HandleUpdateUserInfo();
	void STATIC_HandleDialogOK();
	void STATIC_SetItemCount();
	int STATIC_GetMyInventoryLimit();
	void STATIC_UseItem(class UItemWindowHandle* a_hItemWindow, int Index);
	void STATIC_SetAdenaText();
	void STATIC_UpdateHennaInfo();
	void STATIC_HandleUpdateHennaInfo(const struct FString& param);
	void STATIC_HandleAddHennaInfo(const struct FString& param);
	void STATIC_HandleItemListEnd();
	void STATIC_HandleUpdateItem(const struct FString& param);
	void STATIC_HandleAddItem(const struct FString& param);
	void STATIC_HandleHideWindow();
	void STATIC_OpenWindow();
	void STATIC_HandleOpenWindow(const struct FString& param);
	void STATIC_EquipItemUpdate(const struct FItemInfo& a_Info);
	void STATIC_FingerItemUpdate();
	void STATIC_EarItemUpdate();
	void STATIC_EquipItemDelete(const struct FItemID& sID);
	bool STATIC_EquipItemFind(const struct FItemID& sID);
	void STATIC_EquipItemClear();
	int STATIC_EquipItemGetItemNum();
	void STATIC_HandleClear();
	bool STATIC_IsQuestItem(struct FItemInfo* Info);
	bool STATIC_IsEquipItem(struct FItemInfo* Info);
	void STATIC_OnDropItemSource(const struct FString& strTarget, const struct FItemInfo& Info);
	void STATIC_OnDropItem(const struct FString& strTarget, const struct FItemInfo& Info, int X, int Y);
	void STATIC_OnSelectItemWithHandle(class UItemWindowHandle* a_hItemWindow, int a_Index);
	void STATIC_OnRClickItemWithHandle(class UItemWindowHandle* a_hItemWindow, int Index);
	void STATIC_OnDBClickItemWithHandle(class UItemWindowHandle* a_hItemWindow, int Index);
	void STATIC_OnExitState(const struct FName& a_NextStateName);
	void STATIC_OnEnterState(const struct FName& a_PrevStateName);
	void STATIC_HandleRestart();
	void STATIC_OnHide();
	void STATIC_CheckShowCrystallizeButton();
	void STATIC_OnShow();
	void STATIC_OnEvent(int Event_ID, const struct FString& param);
	void STATIC_InitScrollBar();
	void STATIC_InitHandleCOD();
	void STATIC_InitHandle();
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.QuestTreeWnd
// 0x0124 (0x0160 - 0x003C)
class UQuestTreeWnd : public UUICommonAPI
{
public:
	struct FString                                     m_WindowName;                                             // 0x003C(0x000C) (NeedCtorLink)
	int                                                m_QuestNum;                                               // 0x0048(0x0004)
	int                                                m_OldQuestID;                                             // 0x004C(0x0004)
	struct FString                                     m_CurNodeName;                                            // 0x0050(0x000C) (NeedCtorLink)
	int                                                m_DeleteQuestID;                                          // 0x005C(0x0004)
	struct FString                                     m_DeleteNodeName;                                         // 0x0060(0x000C) (NeedCtorLink)
	struct FString                                     m_CurTab;                                                 // 0x006C(0x000C) (NeedCtorLink)
	unsigned long                                      m_bDrawBg : 1;                                            // 0x0078(0x0004)
	unsigned long                                      m_bDrawBg2 : 1;                                           // 0x0078(0x0004)
	unsigned long                                      m_bDrawBg3 : 1;                                           // 0x0078(0x0004)
	TArray<struct FString>                             m_arrItemNodeName;                                        // 0x007C(0x000C) (NeedCtorLink)
	TArray<struct FString>                             m_arrItemString;                                          // 0x0088(0x000C) (NeedCtorLink)
	TArray<int>                                        m_arrItemID;                                              // 0x0094(0x000C) (NeedCtorLink)
	TArray<int>                                        m_arrItemQuestID;                                         // 0x00A0(0x000C) (NeedCtorLink)
	TArray<int>                                        m_arrItemLevel;                                           // 0x00AC(0x000C) (NeedCtorLink)
	TArray<int>                                        m_arrItemNumList;                                         // 0x00B8(0x000C) (NeedCtorLink)
	TArray<struct FLVDataRecord>                       m_QuestTrackData;                                         // 0x00C4(0x000C) (NeedCtorLink)
	int                                                m_TrackID;                                                // 0x00D0(0x0004)
	class UTextBoxHandle*                              m_txtQuestNum;                                            // 0x00D4(0x0004)
	class UWindowHandle*                               Me;                                                       // 0x00D8(0x0004)
	class UWindowHandle*                               Drawer;                                                   // 0x00DC(0x0004)
	class UTextureHandle*                              m_QuestTooltip;                                           // 0x00E0(0x0004)
	class UQuestAlarmWnd*                              m_scriptAlarm;                                            // 0x00E4(0x0004)
	class UTreeHandle*                                 MainTree0;                                                // 0x00E8(0x0004)
	class UTreeHandle*                                 MainTree1;                                                // 0x00EC(0x0004)
	class UTreeHandle*                                 MainTree2;                                                // 0x00F0(0x0004)
	class UTreeHandle*                                 MainTree3;                                                // 0x00F4(0x0004)
	class UTreeHandle*                                 MainTree4;                                                // 0x00F8(0x0004)
	class UTreeHandle*                                 CurTree;                                                  // 0x00FC(0x0004)
	class UTabHandle*                                  QuestTabCtrl;                                             // 0x0100(0x0004)
	class UButtonHandle*                               m_btnAddAlarm;                                            // 0x0104(0x0004)
	class UButtonHandle*                               m_btnDeleteAlarm;                                         // 0x0108(0x0004)
	class UCheckBoxHandle*                             CheckAssignNotifier;                                      // 0x010C(0x0004)
	class UCheckBoxHandle*                             checkNpcPosBox;                                           // 0x0110(0x0004)
	class UTextBoxHandle*                              Drawer_txtQuestTitle;                                     // 0x0114(0x0004)
	class UTextBoxHandle*                              Drawer_txtQuestRecommandedLevel;                          // 0x0118(0x0004)
	class UTextBoxHandle*                              Drawer_txtQuestType;                                      // 0x011C(0x0004)
	class UTreeHandle*                                 Drawer_QuestDescriptionTree;                              // 0x0120(0x0004)
	class UTreeHandle*                                 Drawer_QuestDescriptionLargeTree;                         // 0x0124(0x0004)
	class UTreeHandle*                                 Drawer_QuestItemTree;                                     // 0x0128(0x0004)
	class UTreeHandle*                                 Drawer_QuestRewardItemTree;                               // 0x012C(0x0004)
	class UButtonHandle*                               Drawer_btnGiveUpCurrentQuest;                             // 0x0130(0x0004)
	class UButtonHandle*                               Drawer_btnClose;                                          // 0x0134(0x0004)
	class UTextBoxHandle*                              Drawer_txtQuestItemTitle;                                 // 0x0138(0x0004)
	class UTextBoxHandle*                              Drawer_txtQuestRewardItemTreeTitle;                       // 0x013C(0x0004)
	class UTextureHandle*                              Drawer_GroupBox_DescriptionTree;                          // 0x0140(0x0004)
	class UTextureHandle*                              Drawer_GroupBox_ItemTree;                                 // 0x0144(0x0004)
	class UTextBoxHandle*                              Drawer_txtRecommandedLevelText;                           // 0x0148(0x0004)
	class UListCtrlHandle*                             ListTrackItem1;                                           // 0x014C(0x0004)
	int                                                QuestID_Alarm;                                            // 0x0150(0x0004)
	int                                                QuestLevel_Alarm;                                         // 0x0154(0x0004)
	int                                                QuestEnd_Alarm;                                           // 0x0158(0x0004)
	unsigned long                                      QuestAutoAlarm : 1;                                       // 0x015C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.QuestTreeWnd");
		return ptr;
	}


	int STATIC_GetSelectedJournalLevelID(const struct FString& CurrentSelectedNodeID);
	int STATIC_GetSelectedJournalQuestID(const struct FString& CurrentSelectedNodeID);
	void STATIC_SetCurrentQuestJournalOnDrawerWnd(int QuestID, int QuestLevel, int Completed);
	void STATIC_InsertQuestTrackList();
	struct FString STATIC_ProcInsertNode(int QuestID, int Level, const struct FString& strParentName, const struct FXMLTreeNodeInfo& infNode);
	void STATIC_InsertNodeItem(int QuestID, int Level, const struct FString& strRetName, const struct FXMLTreeNodeItemInfo& infNodeItem);
	void STATIC_GetNodeInfo_Alarm();
	void STATIC_ButtonEnableCheck();
	void STATIC_HandleDeleteAlarm();
	void STATIC_HandleAddAlarm();
	void STATIC_HandleLanguageChanged();
	void STATIC_InitQuestTooltip();
	void STATIC_AddQuestInfo(const struct FString& strParentName, int QuestID, int Level, int Completed);
	void STATIC_HandleQuestCancel();
	struct FString STATIC_GetExpandedNode();
	void STATIC_SetQuestOff();
	void STATIC_UpdateTargetInfo();
	void STATIC_UpdateQuestCount();
	void STATIC_UpdateItemCountWhenAdd(int ClassID);
	void STATIC_UpdateItemCount(int ClassID, const struct FINT64& a_ItemCount);
	void STATIC_HandleQuestSetCurrentIDfromMiniMap(int QuestID, int Level);
	void STATIC_HandleQuestSetCurrentID(const struct FString& param);
	void STATIC_OnEvent(int Event_ID, const struct FString& param);
	void STATIC_HandleQuestListEnd();
	void STATIC_HandleQuestList(const struct FString& a_Param);
	void STATIC_HandleQuestListStart();
	void STATIC_InitTree();
	void STATIC_ShowQuestList();
	void Clear();
	void STATIC_OnClickCheckBox(const struct FString& strID);
	void STATIC_GetCurrentJournalID(const struct FString& strID);
	void STATIC_OnClickButton(const struct FString& strID);
	void STATIC_OnHide();
	void STATIC_OnShow();
	void STATIC_OnDefaultPosition();
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.QuestAlarmWnd
// 0x0258 (0x0294 - 0x003C)
class UQuestAlarmWnd : public UUICommonAPI
{
public:
	unsigned long                                      isWaitExpand : 1;                                         // 0x003C(0x0004)
	unsigned long                                      isWaitContract : 1;                                       // 0x003C(0x0004)
	unsigned long                                      isExpand : 1;                                             // 0x003C(0x0004)
	unsigned long                                      isClickedAdd : 1;                                         // 0x003C(0x0004)
	int                                                m_NumOfQuest;                                             // 0x0040(0x0004)
	int                                                i;                                                        // 0x0044(0x0004)
	int                                                j;                                                        // 0x0048(0x0004)
	struct FColor                                      Gold;                                                     // 0x004C(0x0004)
	struct FColor                                      White;                                                    // 0x0050(0x0004)
	struct FColor                                      Gray;                                                     // 0x0054(0x0004)
	class UWindowHandle*                               Me;                                                       // 0x0058(0x0004)
	class UWindowHandle*                               QuestWndOverCheck;                                        // 0x005C(0x0004)
	class UButtonHandle*                               BtnClose;                                                 // 0x0060(0x0004)
	class UWindowHandle*                               QuestWnd[0x5];                                            // 0x0064(0x0004)
	class UNameCtrlHandle*                             QuestAlarmName[0x5];                                      // 0x0078(0x0004)
	int                                                QuestAlarmNameID[0x5];                                    // 0x008C(0x0004)
	class UNameCtrlHandle*                             QuestItemName[0x19];                                      // 0x00A0(0x0004)
	int                                                QuestItemNameID[0x19];                                    // 0x0104(0x0004)
	class UTextBoxHandle*                              QuestItemNum[0x19];                                       // 0x0168(0x0004)
	struct FINT64                                      QuestItemNumInt[0x19];                                    // 0x01CC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.QuestAlarmWnd");
		return ptr;
	}


	int STATIC_QuestItemSlotIdx(int QuestIdx, int ItemID);
	int STATIC_FindEmptyItemSlot(int QuestIdx);
	int STATIC_QuestSlotIdx(int QuestID);
	int STATIC_FindEmptyQuestSlot();
	void STATIC_UpdateAlarmItem(int ItemID, const struct FINT64& Count);
	void STATIC_DeleteQuestAlarm(int QuestID);
	void STATIC_AddQuestAlarm(int QuestID, int Level, int ItemID, const struct FINT64& ItemNum);
	void STATIC_FitWindowSize();
	void STATIC_ContractWindowSize();
	void STATIC_ExpendWindowSize();
	void STATIC_OnbtnCloseClick();
	void STATIC_OnClickButton(const struct FString& Name);
	void STATIC_OnTimer(int TimerID);
	void STATIC_OnEvent(int a_EventID, const struct FString& a_Param);
	void STATIC_InitData();
	void STATIC_Load();
	void STATIC_InitializeCOD();
	void Initialize();
	void STATIC_OnLoad();
	void STATIC_OnRegisterEvent();
};


// Class Interface.MinimapWnd
// 0x0184 (0x01C0 - 0x003C)
class UMinimapWnd : public UUICommonAPI
{
public:
	int                                                m_PartyMemberCount;                                       // 0x003C(0x0004)
	int                                                m_PartyLocIndex;                                          // 0x0040(0x0004)
	int                                                b_IsShowGuideWnd;                                         // 0x0044(0x0004)
	unsigned long                                      m_AdjustCursedLoc : 1;                                    // 0x0048(0x0004)
	int                                                m_SSQStatus;                                              // 0x004C(0x0004)
	unsigned long                                      m_bShowSSQType : 1;                                       // 0x0050(0x0004)
	unsigned long                                      m_bShowCurrentLocation : 1;                               // 0x0050(0x0004)
	unsigned long                                      m_bShowGameTime : 1;                                      // 0x0050(0x0004)
	unsigned long                                      bHaveItem : 1;                                            // 0x0050(0x0004)
	unsigned long                                      bMiniMapDisabled : 1;                                     // 0x0050(0x0004)
	unsigned long                                      m_bExpandState : 1;                                       // 0x0050(0x0004)
	struct FVector                                     BlockedLoc1;                                              // 0x0054(0x000C)
	struct FVector                                     BlockedLoc2;                                              // 0x0060(0x000C)
	int                                                FortressID;                                               // 0x006C(0x0004)
	int                                                SiegeStatus;                                              // 0x0070(0x0004)
	int                                                TotalBarrackCnt;                                          // 0x0074(0x0004)
	int                                                GlobalCurFortressID;                                      // 0x0078(0x0004)
	int                                                G_ZoneID;                                                 // 0x007C(0x0004)
	int                                                G_ZoneID2;                                                // 0x0080(0x0004)
	unsigned long                                      GlobalCurFortressStatus : 1;                              // 0x0084(0x0004)
	struct FString                                     m_combocursedName;                                        // 0x0088(0x000C) (NeedCtorLink)
	unsigned long                                      m_Dominion : 1;                                           // 0x0094(0x0004)
	int                                                m_CurContinent;                                           // 0x0098(0x0004)
	class UWindowHandle*                               Me;                                                       // 0x009C(0x0004)
	class UWindowHandle*                               m_hExpandWnd;                                             // 0x00A0(0x0004)
	class UWindowHandle*                               m_hGuideWnd;                                              // 0x00A4(0x0004)
	class UItemWindowHandle*                           m_questItem;                                              // 0x00A8(0x0004)
	class UMinimapCtrlHandle*                          m_MiniMap;                                                // 0x00AC(0x0004)
	class UButtonHandle*                               Btn_Refresh;                                              // 0x00B0(0x0004)
	class UButtonHandle*                               Btn_Refresh_Expand;                                       // 0x00B4(0x0004)
	class UButtonHandle*                               ReduceButton;                                             // 0x00B8(0x0004)
	class UButtonHandle*                               ReduceButton_Expand;                                      // 0x00BC(0x0004)
	class UTextBoxHandle*                              m_textSSQ;                                                // 0x00C0(0x0004)
	class UTextBoxHandle*                              m_textSSQStatus;                                          // 0x00C4(0x0004)
	class UTextBoxHandle*                              m_textSSQ_Expand;                                         // 0x00C8(0x0004)
	class UTextBoxHandle*                              m_textSSQStatus_Expand;                                   // 0x00CC(0x0004)
	class UTabHandle*                                  m_MapSelectTab;                                           // 0x00D0(0x0004)
	class UWindowHandle*                               CleftCurTriggerWnd;                                       // 0x00D4(0x0004)
	class UListCtrlHandle*                             ListTrackItem3;                                           // 0x00D8(0x0004)
	class UListCtrlHandle*                             ListTrackItem2;                                           // 0x00DC(0x0004)
	TArray<int>                                        loc_fortress;                                             // 0x00E0(0x000C) (NeedCtorLink)
	TArray<int>                                        loc_component;                                            // 0x00EC(0x000C) (NeedCtorLink)
	TArray<int>                                        loc_sysstr;                                               // 0x00F8(0x000C) (NeedCtorLink)
	TArray<int>                                        loc_xloc;                                                 // 0x0104(0x000C) (NeedCtorLink)
	TArray<int>                                        loc_yloc;                                                 // 0x0110(0x000C) (NeedCtorLink)
	int                                                loc_cleftx[0x5];                                          // 0x011C(0x0004)
	int                                                loc_clefty[0x5];                                          // 0x0130(0x0004)
	struct FString                                     loc_cleftName[0x5];                                       // 0x0144(0x000C) (NeedCtorLink)
	struct FString                                     loc_cleftIcon[0x5];                                       // 0x0180(0x000C) (NeedCtorLink)
	class UWindowHandle*                               MiniMapDrawerWnd;                                         // 0x01BC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Interface.MinimapWnd");
		return ptr;
	}


	int STATIC_GetContinent(const struct FVector& Loc);
	void STATIC_SetLocContinent(const struct FVector& Loc);
	void STATIC_SetContinent(int Continent);
	void STATIC_DrawCleftStatus();
	void STATIC_HandleDominionsOwnPos(const struct FString& param);
	void STATIC_InitializeLocation();
	void STATIC_DrawMapMainInfo(int ReturnInt);
	void STATIC_DrawMapAfterBarrack(int ReturnInt);
	void STATIC_DrawMapBasicInfo(int ReturnInt);
	int STATIC_BarrackID2Int(int FortressID, int BarrackID);
	struct FString STATIC_BarrackID2Text(int FortressID, int BarrackID);
	struct FString STATIC_BarrackID2YLoc(int FortressID, int BarrackID);
	struct FString STATIC_BarrackID2XLoc(int FortressID, int BarrackID);
	void STATIC_HandleFortressMapBarrackInfo(const struct FString& param);
	void STATIC_HandleShowFortressMapInfo(const struct FString& param);
	void STATIC_DrawPeaceStatusFortressSiegeStatus(const struct FString& param);
	void STATIC_SelectSunOrMoon(int GameHour);
	void STATIC_HandleMinimapTravel(const struct FString& a_Param);
	void STATIC_HandleUpdateGameTime(const struct FString& a_Param);
	void STATIC_DrawCursedWeapon(const struct FString& WindowName, int ItemID, const struct FString& cursedName, const struct FVector& vecLoc, bool bDropped, bool bRefresh);
	void STATIC_HandleCursedWeaponLoctaion(const struct FString& param);
	void STATIC_HandleCursedWeaponList(const struct FString& param);
	void STATIC_OnClickPartyLocButton();
	void STATIC_AdjustMapToPlayerPosition(bool a_ZoomToTownMap);
	void STATIC_OnClickMyLocButton();
	void STATIC_OnClickTargetButton();
	void STATIC_OnClickReduceButton();
	void STATIC_OnClickButton(const struct FString& a_ButtonID);
	void STATIC_HandleMinimapHideQuest();
