#pragma once

// Lineage 2 (Gracia Final) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace L2_SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_SkillEnchantInfoWnd_OFFSET_X_ICON_TEXTURE          0
#define CONST_MAX_OLYMPIAD_SKILL_MSG                              5
#define CONST_MULTISELLWND_DIALOG_OK                             1122
#define CONST_N_MAX_MINI_MAP_RES_X                                1024
#define CONST_MenuWnd_TimerValue2                                 888
#define CONST_ManorInfoWnd_SEED_LEVEL                            4
#define CONST_WarehouseWnd_DIALOG_BOTTOM_TO_TOP                   222
#define CONST_FS_TIME                                             45000
#define CONST_SkillEnchantInfoWnd_ENCHANT_ROOT_CHANGE            3
#define CONST_MinimapWnd_REGIONINFO_OFFSETX                       225
#define CONST_SkillEnchantInfoWnd_ENCHANT_NORMAL                 0
#define CONST_PartyWndCompact_NPARTYSTATUS_HEIGHT                 26
#define CONST_ManorSeedInfoSettingWnd_SEED_NAME                  0
#define CONST_DLG_ID_RESTART                                     0
#define CONST_N_MAX_MINI_MAP_RES_Y                                1024
#define CONST_N_BUTTON_HEAD_AREA_BUFFER                           90
#define CONST_EQUIPITEM_Deco2                                     18

#define CONST_QuestAlarmWnd_TIMER_DELAY                          2000
#define CONST_QuestAlarmWnd_TIMER_DELAY2                         500
#define CONST_OlympiadPlayerWnd_CONTRACT_HEIGHT                   44
#define CONST_Shortcut_CHAT_WINDOW_COUNT                          5
#define CONST_CONTRACT_QUEST_NAME_WIDTH                           198
#define CONST_CONTRACT_ITEM_NAME_WIDTH                            113
#define CONST_RadarMapWnd_TIMER_DELAY4                           3000
#define CONST_AbnormalStatusWnd_NSTATUSICON_MAXCOL                12
#define CONST_EXPEND_ITEM_NAME_WIDTH                              150
#define CONST_FS_TIMER_ID                                         151
#define CONST_ALPHA_TIME                                          100
#define CONST_LIGHT_ALPHA                                         250
#define CONST_REQUEST_HEIGHT                                      800
#define CONST_REQUEST_PARTY_DISTANCE_3                            9000
#define CONST_REQUEST_PARTY_DISTANCE_2                            12000
#define CONST_REQUEST_PARTY_DISTANCE                              5000
#define CONST_MAX_MAG                                             4
#define CONST_OBJ_TYPE_CLANMEMBER                                3
#define CONST_MAG_3                                               1.0
#define CONST_RadarMapWnd_TIMER_ID2                              124
#define CONST_MAG_1                                               1.5
#define CONST_MAX_MONSTER                                        20
#define CONST_TARGET_RADAR_ID                                    7777
#define CONST_EV_USER_CharacterSelectionChanged                   50000
#define CONST_MAX_HIDE_POS                                       79
#define CONST_OBJ_TYPE_ADENA                                     6
#define CONST_OBJ_TYPE_ITEM                                      5
#define CONST_OBJ_TYPE_ALLIANCEMEMBER                            4
#define CONST_WINDOW_HEIGHT_MARGIN                                10
#define CONST_PVPCounter_TIMER_ID                                1023
#define CONST_MAX_QUEST_ALL                                       25
#define CONST_REPLAY_DIR                                         "..\\REPLAY"
#define CONST_REPLAY_EXTENSION                                   ".L2R"
#define CONST_SSQE_TIMEATTACK                                     0
#define CONST_Shortcut_CHAT_WINDOW_NORMAL                         0
#define CONST_Shortcut_CHAT_WINDOW_CLAN                           3
#define CONST_NC_PARTYMEMBER_MAX                                  9
#define CONST_SSQR_STATUS                                         1
#define CONST_SSQR_PREINFO                                        4
#define CONST_SSQS_GREED                                          1
#define CONST_SSQS_REVEAL                                         2

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum Interface.CalculatorWnd.EOperator
enum class EOperator : uint8_t
{
	OP_None                        = 0,
	OP_PLUS                        = 1,
	OP_MINUS                       = 2,
	OP_MULTIPLY                    = 3,
	OP_DIVIDE                      = 4
};


// Enum Interface.UICommonAPI.EDialogType
enum class EDialogType : uint8_t
{
	DIALOG_OKCancel                = 0,
	DIALOG_OK                      = 1,
	DIALOG_OKCancelInput           = 2,
	DIALOG_OKInput                 = 3,
	DIALOG_Warning                 = 4,
	DIALOG_Notice                  = 5,
	DIALOG_NumberPad               = 6,
	DIALOG_Progress                = 7
};


// Enum Interface.UICommonAPI.DialogDefaultAction
enum class EDialogDefaultAction : uint8_t
{
	EDefaultNone                   = 0,
	EDefaultOK                     = 1,
	EDefaultCancel                 = 2
};


// Enum Interface.PrivateShopWnd.PrivateShopType
enum class EPrivateShopType : uint8_t
{
	PT_None                        = 0,
	PT_Buy                         = 1,
	PT_Sell                        = 2,
	PT_BuyList                     = 3,
	PT_SellList                    = 4
};


// Enum Interface.EventMatchObserverWnd.EMessageMode
enum class EMessageMode : uint8_t
{
	MESSAGEMODE_Normal             = 0,
	MESSAGEMODE_LeftRight          = 1,
	MESSAGEMODE_Off                = 2
};


// Enum Interface.WarehouseWnd.WarehouseCategory
enum class EWarehouseCategory : uint8_t
{
	WC_None                        = 0,
	WC_Private                     = 1,
	WC_Clan                        = 2,
	WC_Castle                      = 3,
	WC_Etc                         = 4
};


// Enum Interface.WarehouseWnd.WarehouseType
enum class EWarehouseType : uint8_t
{
	WT_Deposit                     = 0,
	WT_Withdraw                    = 1
};


// Enum Interface.ShortcutWnd.EJoyShortcut
enum class EJoyShortcut : uint8_t
{
	JOYSHORTCUT_Left               = 0,
	JOYSHORTCUT_Center             = 1,
	JOYSHORTCUT_Right              = 2
};


// Enum Interface.ShopWnd.ShopType
enum class EShopType : uint8_t
{
	ShopNone                       = 0,
	ShopBuy                        = 1,
	ShopSell                       = 2,
	ShopPreview                    = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// Struct Interface.MiniGame1Wnd.MG1CellData
// 0x0028
struct FMG1CellData
{
	int                                                X;                                                        // 0x0000(0x0004)
	int                                                Y;                                                        // 0x0004(0x0004)
	int                                                RV;                                                       // 0x0008(0x0004)
	struct FString                                     BtnTex;                                                   // 0x000C(0x000C) (NeedCtorLink)
	unsigned long                                      isFlagged : 1;                                            // 0x0018(0x0004)
	class UTextureHandle*                              TextureLoc;                                               // 0x001C(0x0004)
	class UButtonHandle*                               ButtonLoc;                                                // 0x0020(0x0004)
	class UAnimTextureHandle*                          AnimLoc;                                                  // 0x0024(0x0004)
};

// Struct Interface.SSQMainBoard.SSQMainEventInfo
// 0x00F8
struct FSSQMainEventInfo
{
	int                                                m_nSSQStatus;                                             // 0x0000(0x0004)
	int                                                m_nEventType;                                             // 0x0004(0x0004)
	int                                                m_nEventNo;                                               // 0x0008(0x0004)
	int                                                m_nWinPoint;                                              // 0x000C(0x0004)
	struct FINT64                                      m_nTeam1Score;                                            // 0x0010(0x0008)
	struct FINT64                                      m_nTeam2Score;                                            // 0x0018(0x0008)
	struct FString                                     m_Team1MemberName[0x9];                                   // 0x0020(0x000C) (NeedCtorLink)
	struct FString                                     m_Team2MemberName[0x9];                                   // 0x008C(0x000C) (NeedCtorLink)
};

// Struct Interface.SSQMainBoard.SSQStatusInfo
// 0x0060
struct FSSQStatusInfo
{
	int                                                m_nSSQStatus;                                             // 0x0000(0x0004)
	int                                                m_nSSQTeam;                                               // 0x0004(0x0004)
	int                                                m_nSelectedSeal;                                          // 0x0008(0x0004)
	struct FINT64                                      m_nContribution;                                          // 0x000C(0x0008)
	struct FINT64                                      m_nTeam1HuntingMark;                                      // 0x0014(0x0008)
	struct FINT64                                      m_nTeam2HuntingMark;                                      // 0x001C(0x0008)
	struct FINT64                                      m_nTeam1MainEventMark;                                    // 0x0024(0x0008)
	struct FINT64                                      m_nTeam2MainEventMark;                                    // 0x002C(0x0008)
	int                                                m_nTeam1Per;                                              // 0x0034(0x0004)
	int                                                m_nTeam2Per;                                              // 0x0038(0x0004)
	struct FINT64                                      m_nTeam1TotalMark;                                        // 0x003C(0x0008)
	struct FINT64                                      m_nTeam2TotalMark;                                        // 0x0044(0x0008)
	int                                                m_nPeriod;                                                // 0x004C(0x0004)
	int                                                m_nMsgNum1;                                               // 0x0050(0x0004)
	int                                                m_nMsgNum2;                                               // 0x0054(0x0004)
	struct FINT64                                      m_nSealStoneAdena;                                        // 0x0058(0x0008)
};

// Struct Interface.SSQMainBoard.SSQPreStatusInfo
// 0x002C
struct FSSQPreStatusInfo
{
	int                                                m_nWinner;                                                // 0x0000(0x0004)
	int                                                m_nRoomNum;                                               // 0x0004(0x0004)
	TArray<int>                                        m_nSealNumArray;                                          // 0x0008(0x000C) (NeedCtorLink)
	TArray<int>                                        m_nWinnerArray;                                           // 0x0014(0x000C) (NeedCtorLink)
	TArray<int>                                        m_nMsgArray;                                              // 0x0020(0x000C) (NeedCtorLink)
};

// Struct Interface.ChatWnd.ChatFilterInfo
// 0x0038
struct FChatFilterInfo
{
	int                                                bSystem;                                                  // 0x0000(0x0004)
	int                                                bChat;                                                    // 0x0004(0x0004)
	int                                                bDamage;                                                  // 0x0008(0x0004)
	int                                                bNormal;                                                  // 0x000C(0x0004)
	int                                                bShout;                                                   // 0x0010(0x0004)
	int                                                bClan;                                                    // 0x0014(0x0004)
	int                                                bParty;                                                   // 0x0018(0x0004)
	int                                                bTrade;                                                   // 0x001C(0x0004)
	int                                                bWhisper;                                                 // 0x0020(0x0004)
	int                                                bAlly;                                                    // 0x0024(0x0004)
	int                                                bUseitem;                                                 // 0x0028(0x0004)
	int                                                bHero;                                                    // 0x002C(0x0004)
	int                                                bUnion;                                                   // 0x0030(0x0004)
	int                                                bBattle;                                                  // 0x0034(0x0004)
};

// Struct Interface.ChatWnd.ChatUIType
// 0x0008
struct FChatUIType
{
	int                                                Id;                                                       // 0x0000(0x0004)
	int                                                UI;                                                       // 0x0004(0x0004)
};

// Struct Interface.EventMatchObserverWnd.SkillMsgInfo
// 0x0034
struct FSkillMsgInfo
{
	int                                                AttackerTeamID;                                           // 0x0000(0x0004)
	int                                                AttackerUserID;                                           // 0x0004(0x0004)
	struct FString                                     AttackerName;                                             // 0x0008(0x000C) (NeedCtorLink)
	int                                                DefenderTeamID;                                           // 0x0014(0x0004)
	int                                                DefenderUserID;                                           // 0x0018(0x0004)
	struct FString                                     DefenderName;                                             // 0x001C(0x000C) (NeedCtorLink)
	struct FString                                     SkillName;                                                // 0x0028(0x000C) (NeedCtorLink)
};

// Struct Interface.SkillEnchantInfoWnd.SkillDetailItem
// 0x0068
struct FSkillDetailItem
{
	struct FString                                     strIconName;                                              // 0x0000(0x000C) (NeedCtorLink)
	struct FString                                     strName;                                                  // 0x000C(0x000C) (NeedCtorLink)
	int                                                iID;                                                      // 0x0018(0x0004)
	int                                                iLevel;                                                   // 0x001C(0x0004)
	struct FString                                     strOperateType;                                           // 0x0020(0x000C) (NeedCtorLink)
	int                                                iMPConsume;                                               // 0x002C(0x0004)
	int                                                iCastRange;                                               // 0x0030(0x0004)
	int                                                iSPConsume;                                               // 0x0034(0x0004)
	struct FString                                     strDescription;                                           // 0x0038(0x000C) (NeedCtorLink)
	struct FINT64                                      iEXPConsume;                                              // 0x0044(0x0008)
	struct FString                                     strEnchantName;                                           // 0x004C(0x000C) (NeedCtorLink)
	struct FString                                     strEnchantDesc;                                           // 0x0058(0x000C) (NeedCtorLink)
	int                                                iPercent;                                                 // 0x0064(0x0004)
};

// Struct Interface.BR_CashShopWnd.ProductInfo
// 0x0028
struct FProductInfo
{
	int                                                iProductID;                                               // 0x0000(0x0004)
	int                                                iCategory;                                                // 0x0004(0x0004)
	int                                                iShowTab;                                                 // 0x0008(0x0004)
	int                                                iPrice;                                                   // 0x000C(0x0004)
	struct FString                                     strName;                                                  // 0x0010(0x000C) (NeedCtorLink)
	struct FString                                     strIconName;                                              // 0x001C(0x000C) (NeedCtorLink)
};

// Struct Interface.GuideWnd.RAIDRECORD
// 0x000C
struct FRAIDRECORD
{
	int                                                A;                                                        // 0x0000(0x0004)
	int                                                B;                                                        // 0x0004(0x0004)
	int                                                C;                                                        // 0x0008(0x0004)
};

// Struct Interface.PARTYWND.VnameData
// 0x0024
struct UPARTYWND_FVnameData
{
	int                                                Id;                                                       // 0x0000(0x0004)
	int                                                UseVName;                                                 // 0x0004(0x0004)
	int                                                DominionIDForVName;                                       // 0x0008(0x0004)
	struct FString                                     VName;                                                    // 0x000C(0x000C) (NeedCtorLink)
	struct FString                                     SummonVName;                                              // 0x0018(0x000C) (NeedCtorLink)
};

// Struct Interface.MultiSellWnd.MultiSellInfo
// 0x01D0
struct FMultiSellInfo
{
	int                                                MultiSellInfoID;                                          // 0x0000(0x0004)
	int                                                MultiSellType;                                            // 0x0004(0x0004)
	struct FINT64                                      NeededItemNum;                                            // 0x0008(0x0008)
	struct FItemInfo                                   ResultItemInfo;                                           // 0x0010(0x01A8) (NeedCtorLink)
	TArray<struct FItemInfo>                           OutputItemInfoList;                                       // 0x01B8(0x000C) (NeedCtorLink)
	TArray<struct FItemInfo>                           InputItemInfoList;                                        // 0x01C4(0x000C) (NeedCtorLink)
};

// Struct Interface.PartyWndCompact.VnameData
// 0x0024
struct UPartyWndCompact_FVnameData
{
	int                                                Id;                                                       // 0x0000(0x0004)
	int                                                UseVName;                                                 // 0x0004(0x0004)
	int                                                DominionIDForVName;                                       // 0x0008(0x0004)
	struct FString                                     VName;                                                    // 0x000C(0x000C) (NeedCtorLink)
	struct FString                                     SummonVName;                                              // 0x0018(0x000C) (NeedCtorLink)
};

// Struct Interface.OlympiadPlayerWnd.OlympiadUserInfo
// 0x0028
struct FOlympiadUserInfo
{
	int                                                m_TeamID;                                                 // 0x0000(0x0004)
	int                                                m_id;                                                     // 0x0004(0x0004)
	struct FString                                     m_Name;                                                   // 0x0008(0x000C) (NeedCtorLink)
	int                                                m_ClassID;                                                // 0x0014(0x0004)
	int                                                m_MaxHP;                                                  // 0x0018(0x0004)
	int                                                m_CurHP;                                                  // 0x001C(0x0004)
	int                                                m_MaxCP;                                                  // 0x0020(0x0004)
	int                                                m_CurCP;                                                  // 0x0024(0x0004)
};

// Struct Interface.KillPointRankWnd.KillPointWndData
// 0x0010
struct FKillPointWndData
{
	struct FString                                     Name;                                                     // 0x0000(0x000C) (NeedCtorLink)
	int                                                KillPoint;                                                // 0x000C(0x0004)
};

// Struct Interface.GMInventoryWnd.GMHennaInfo
// 0x0008
struct FGMHennaInfo
{
	int                                                HennaID;                                                  // 0x0000(0x0004)
	int                                                IsActive;                                                 // 0x0004(0x0004)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
