#pragma once

// Lineage 2 (Gracia Final) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace L2_SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class NWindow.CObject
// 0x0000 (0x0034 - 0x0034)
class UCObject : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CObject");
		return ptr;
	}

};


// Class NWindow.CWnd
// 0x01A4 (0x01D8 - 0x0034)
class UCWnd : public UCObject
{
public:
	unsigned char                                      UnknownData00[0x1A4];                                     // 0x0034(0x01A4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CWnd");
		return ptr;
	}

};


// Class NWindow.CScrollWnd
// 0x0058 (0x0230 - 0x01D8)
class UCScrollWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x01D8(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CScrollWnd");
		return ptr;
	}

};


// Class NWindow.CXMLTreeCtrl
// 0x000C (0x023C - 0x0230)
class UCXMLTreeCtrl : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0230(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CXMLTreeCtrl");
		return ptr;
	}

};


// Class NWindow.Control
// 0x0018 (0x01F0 - 0x01D8)
class UControl : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01D8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.Control");
		return ptr;
	}

};


// Class NWindow.CXMLTree
// 0x005C (0x024C - 0x01F0)
class UCXMLTree : public UControl
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x01F0(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CXMLTree");
		return ptr;
	}

};


// Class NWindow.CPositionInfo
// 0x0018 (0x004C - 0x0034)
class UCPositionInfo : public UCObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0034(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPositionInfo");
		return ptr;
	}

};


// Class NWindow.CVIPShopItemInfoWnd
// 0x019C (0x03CC - 0x0230)
class UCVIPShopItemInfoWnd : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0x19C];                                     // 0x0230(0x019C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CVIPShopItemInfoWnd");
		return ptr;
	}

};


// Class NWindow.CVIPShopNeededItemWnd
// 0x00E4 (0x0314 - 0x0230)
class UCVIPShopNeededItemWnd : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0xE4];                                      // 0x0230(0x00E4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CVIPShopNeededItemWnd");
		return ptr;
	}

};


// Class NWindow.CVideoPlayer
// 0x0040 (0x0218 - 0x01D8)
class UCVideoPlayer : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x01D8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CVideoPlayer");
		return ptr;
	}

};


// Class NWindow.CTreeCtrl
// 0x0014 (0x0244 - 0x0230)
class UCTreeCtrl : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0230(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTreeCtrl");
		return ptr;
	}

};


// Class NWindow.CTree
// 0x0028 (0x0218 - 0x01F0)
class UCTree : public UControl
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01F0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTree");
		return ptr;
	}

};


// Class NWindow.CTracker
// 0x0048 (0x0238 - 0x01F0)
class UCTracker : public UControl
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x01F0(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTracker");
		return ptr;
	}

};


// Class NWindow.CTrackerMoveBox
// 0x0008 (0x01F8 - 0x01F0)
class UCTrackerMoveBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01F0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTrackerMoveBox");
		return ptr;
	}

};


// Class NWindow.CTrackerPoint
// 0x0018 (0x0208 - 0x01F0)
class UCTrackerPoint : public UControl
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01F0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTrackerPoint");
		return ptr;
	}

};


// Class NWindow.CTextureCtrl
// 0x003C (0x022C - 0x01F0)
class UCTextureCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01F0(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTextureCtrl");
		return ptr;
	}

};


// Class NWindow.CTextBox
// 0x0078 (0x0268 - 0x01F0)
class UCTextBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x01F0(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTextBox");
		return ptr;
	}

};


// Class NWindow.CTextLinkBox
// 0x003C (0x02A4 - 0x0268)
class UCTextLinkBox : public UCTextBox
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0268(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTextLinkBox");
		return ptr;
	}

};


// Class NWindow.CTabControl
// 0x0044 (0x0234 - 0x01F0)
class UCTabControl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x01F0(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTabControl");
		return ptr;
	}

};


// Class NWindow.CStatusIconCtrl
// 0x003C (0x022C - 0x01F0)
class UCStatusIconCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01F0(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CStatusIconCtrl");
		return ptr;
	}

};


// Class NWindow.CItem
// 0x01F0 (0x0224 - 0x0034)
class UCItem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1F0];                                     // 0x0034(0x01F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CItem");
		return ptr;
	}

};


// Class NWindow.CStatusIconItem
// 0x0038 (0x025C - 0x0224)
class UCStatusIconItem : public UCItem
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0224(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CStatusIconItem");
		return ptr;
	}

};


// Class NWindow.CStatusBarCtrl
// 0x00B4 (0x02A4 - 0x01F0)
class UCStatusBarCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0xB4];                                      // 0x01F0(0x00B4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CStatusBarCtrl");
		return ptr;
	}

};


// Class NWindow.CNameCtrl
// 0x006C (0x025C - 0x01F0)
class UCNameCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x6C];                                      // 0x01F0(0x006C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNameCtrl");
		return ptr;
	}

};


// Class NWindow.CSliderCtrl
// 0x003C (0x022C - 0x01F0)
class UCSliderCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01F0(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSliderCtrl");
		return ptr;
	}

};


// Class NWindow.CSliderBar
// 0x002C (0x021C - 0x01F0)
class UCSliderBar : public UControl
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x01F0(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSliderBar");
		return ptr;
	}

};


// Class NWindow.CButton
// 0x005C (0x024C - 0x01F0)
class UCButton : public UControl
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x01F0(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CButton");
		return ptr;
	}

};


// Class NWindow.CShortcutItemWnd
// 0x0020 (0x026C - 0x024C)
class UCShortcutItemWnd : public UCButton
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x024C(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CShortcutItemWnd");
		return ptr;
	}

};


// Class NWindow.CScenePlayerCtrl
// 0x000C (0x01FC - 0x01F0)
class UCScenePlayerCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01F0(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CScenePlayerCtrl");
		return ptr;
	}

};


// Class NWindow.CCheckBox
// 0x003C (0x022C - 0x01F0)
class UCCheckBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01F0(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CCheckBox");
		return ptr;
	}

};


// Class NWindow.CRadioButton
// 0x0004 (0x0230 - 0x022C)
class UCRadioButton : public UCCheckBox
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x022C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CRadioButton");
		return ptr;
	}

};


// Class NWindow.CRadarWnd
// 0x0038 (0x0210 - 0x01D8)
class UCRadarWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x01D8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CRadarWnd");
		return ptr;
	}

};


// Class NWindow.CFrameWnd
// 0x00A4 (0x027C - 0x01D8)
class UCFrameWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xA4];                                      // 0x01D8(0x00A4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CFrameWnd");
		return ptr;
	}

};


// Class NWindow.CRadarMapCtrl
// 0x008C (0x0308 - 0x027C)
class UCRadarMapCtrl : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x8C];                                      // 0x027C(0x008C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CRadarMapCtrl");
		return ptr;
	}

};


// Class NWindow.CRadarObjectCtrl
// 0x0044 (0x0234 - 0x01F0)
class UCRadarObjectCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x01F0(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CRadarObjectCtrl");
		return ptr;
	}

};


// Class NWindow.CPropertyController
// 0x00B4 (0x02A4 - 0x01F0)
class UCPropertyController : public UControl
{
public:
	unsigned char                                      UnknownData00[0xB4];                                      // 0x01F0(0x00B4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPropertyController");
		return ptr;
	}

};


// Class NWindow.CPropertyGroupCtrl
// 0x0044 (0x0234 - 0x01F0)
class UCPropertyGroupCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x01F0(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPropertyGroupCtrl");
		return ptr;
	}

};


// Class NWindow.CPropertyItemCtrl
// 0x000C (0x01FC - 0x01F0)
class UCPropertyItemCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01F0(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPropertyItemCtrl");
		return ptr;
	}

};


// Class NWindow.CMultiEdit
// 0x0110 (0x0300 - 0x01F0)
class UCMultiEdit : public UControl
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x01F0(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMultiEdit");
		return ptr;
	}

};


// Class NWindow.CMinimapWnd
// 0x0128 (0x0300 - 0x01D8)
class UCMinimapWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x128];                                     // 0x01D8(0x0128) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMinimapWnd");
		return ptr;
	}

};


// Class NWindow.CRegionInfoCtrl
// 0x001C (0x020C - 0x01F0)
class UCRegionInfoCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01F0(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CRegionInfoCtrl");
		return ptr;
	}

};


// Class NWindow.CListCtrl
// 0x0084 (0x0274 - 0x01F0)
class UCListCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x84];                                      // 0x01F0(0x0084) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CListCtrl");
		return ptr;
	}

};


// Class NWindow.CHeaderCtrl
// 0x004C (0x023C - 0x01F0)
class UCHeaderCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x4C];                                      // 0x01F0(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHeaderCtrl");
		return ptr;
	}

};


// Class NWindow.CListBox
// 0x005C (0x024C - 0x01F0)
class UCListBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x01F0(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CListBox");
		return ptr;
	}

};


// Class NWindow.CTextListBox
// 0x0000 (0x024C - 0x024C)
class UCTextListBox : public UCListBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTextListBox");
		return ptr;
	}

};


// Class NWindow.CItemWnd
// 0x00CC (0x02FC - 0x0230)
class UCItemWnd : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0xCC];                                      // 0x0230(0x00CC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CItemWnd");
		return ptr;
	}

};


// Class NWindow.CIcon
// 0x0040 (0x0230 - 0x01F0)
class UCIcon : public UControl
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x01F0(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CIcon");
		return ptr;
	}

};


// Class NWindow.CHtmlSliderBar
// 0x0000 (0x021C - 0x021C)
class UCHtmlSliderBar : public UCSliderBar
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlSliderBar");
		return ptr;
	}

};


// Class NWindow.CEditBox
// 0x0174 (0x0364 - 0x01F0)
class UCEditBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x174];                                     // 0x01F0(0x0174) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CEditBox");
		return ptr;
	}

};


// Class NWindow.CHtmlEdit
// 0x0004 (0x0368 - 0x0364)
class UCHtmlEdit : public UCEditBox
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0364(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlEdit");
		return ptr;
	}

};


// Class NWindow.CHtmlMultiEdit
// 0x000C (0x030C - 0x0300)
class UCHtmlMultiEdit : public UCMultiEdit
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0300(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlMultiEdit");
		return ptr;
	}

};


// Class NWindow.CPushButton
// 0x000C (0x0258 - 0x024C)
class UCPushButton : public UCButton
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x024C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPushButton");
		return ptr;
	}

};


// Class NWindow.CHtmlPushButton
// 0x0000 (0x0258 - 0x0258)
class UCHtmlPushButton : public UCPushButton
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlPushButton");
		return ptr;
	}

};


// Class NWindow.CHtmlButton
// 0x0004 (0x0250 - 0x024C)
class UCHtmlButton : public UCButton
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x024C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlButton");
		return ptr;
	}

};


// Class NWindow.CDynamicLinker
// 0x0060 (0x0250 - 0x01F0)
class UCDynamicLinker : public UControl
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x01F0(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CDynamicLinker");
		return ptr;
	}

};


// Class NWindow.CHtmlAction
// 0x0000 (0x0250 - 0x0250)
class UCHtmlAction : public UCDynamicLinker
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlAction");
		return ptr;
	}

};


// Class NWindow.CHtmlLinker
// 0x0000 (0x0250 - 0x0250)
class UCHtmlLinker : public UCDynamicLinker
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlLinker");
		return ptr;
	}

};


// Class NWindow.CActionLinker
// 0x080C (0x09FC - 0x01F0)
class UCActionLinker : public UControl
{
public:
	unsigned char                                      UnknownData00[0x80C];                                     // 0x01F0(0x080C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CActionLinker");
		return ptr;
	}

};


// Class NWindow.CFileLinker
// 0x0018 (0x0208 - 0x01F0)
class UCFileLinker : public UControl
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01F0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CFileLinker");
		return ptr;
	}

};


// Class NWindow.CComboBox
// 0x0068 (0x0258 - 0x01F0)
class UCComboBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x01F0(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CComboBox");
		return ptr;
	}

};


// Class NWindow.CHtmlComboBox
// 0x0000 (0x0258 - 0x0258)
class UCHtmlComboBox : public UCComboBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlComboBox");
		return ptr;
	}

};


// Class NWindow.CDrawerWindowInfo
// 0x0028 (0x005C - 0x0034)
class UCDrawerWindowInfo : public UCObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0034(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CDrawerWindowInfo");
		return ptr;
	}

};


// Class NWindow.CFrameCtrl
// 0x0094 (0x0284 - 0x01F0)
class UCFrameCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x94];                                      // 0x01F0(0x0094) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CFrameCtrl");
		return ptr;
	}

};


// Class NWindow.CResizeFrame
// 0x0040 (0x02C4 - 0x0284)
class UCResizeFrame : public UCFrameCtrl
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0284(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CResizeFrame");
		return ptr;
	}

};


// Class NWindow.CSmallLeftsideFrameCtrl
// 0x0000 (0x0284 - 0x0284)
class UCSmallLeftsideFrameCtrl : public UCFrameCtrl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSmallLeftsideFrameCtrl");
		return ptr;
	}

};


// Class NWindow.CSmallTopFrameCtrl
// 0x0000 (0x0284 - 0x0284)
class UCSmallTopFrameCtrl : public UCFrameCtrl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSmallTopFrameCtrl");
		return ptr;
	}

};


// Class NWindow.CBigTopFrameCtrl
// 0x0000 (0x0284 - 0x0284)
class UCBigTopFrameCtrl : public UCFrameCtrl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CBigTopFrameCtrl");
		return ptr;
	}

};


// Class NWindow.CFlashCtrl
// 0x001C (0x01F4 - 0x01D8)
class UCFlashCtrl : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CFlashCtrl");
		return ptr;
	}

};


// Class NWindow.CEquipItemWnd
// 0x01C0 (0x0398 - 0x01D8)
class UCEquipItemWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x01D8(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CEquipItemWnd");
		return ptr;
	}

};


// Class NWindow.CHennaItem
// 0x0010 (0x0234 - 0x0224)
class UCHennaItem : public UCItem
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0224(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHennaItem");
		return ptr;
	}

};


// Class NWindow.CDrawPanel
// 0x0010 (0x0200 - 0x01F0)
class UCDrawPanel : public UControl
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01F0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CDrawPanel");
		return ptr;
	}

};


// Class NWindow.CDialogBox
// 0x0000 (0x01F0 - 0x01F0)
class UCDialogBox : public UControl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CDialogBox");
		return ptr;
	}

};


// Class NWindow.CWarningDialogBox
// 0x001C (0x020C - 0x01F0)
class UCWarningDialogBox : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01F0(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CWarningDialogBox");
		return ptr;
	}

};


// Class NWindow.CModalessDialogBox
// 0x0098 (0x0288 - 0x01F0)
class UCModalessDialogBox : public UControl
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x01F0(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CModalessDialogBox");
		return ptr;
	}

};


// Class NWindow.CProgressCtrl
// 0x003C (0x022C - 0x01F0)
class UCProgressCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01F0(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CProgressCtrl");
		return ptr;
	}

};


// Class NWindow.CComboEditBox
// 0x0004 (0x025C - 0x0258)
class UCComboEditBox : public UCComboBox
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0258(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CComboEditBox");
		return ptr;
	}

};


// Class NWindow.CCompositeBox
// 0x001C (0x01F4 - 0x01D8)
class UCCompositeBox : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CCompositeBox");
		return ptr;
	}

};


// Class NWindow.CCandidateBox
// 0x005C (0x0234 - 0x01D8)
class UCCandidateBox : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x01D8(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CCandidateBox");
		return ptr;
	}

};


// Class NWindow.CEffectButton
// 0x0030 (0x027C - 0x024C)
class UCEffectButton : public UCButton
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x024C(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CEffectButton");
		return ptr;
	}

};


// Class NWindow.CTabButton
// 0x001C (0x0268 - 0x024C)
class UCTabButton : public UCButton
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x024C(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTabButton");
		return ptr;
	}

};


// Class NWindow.CThumbButton
// 0x0000 (0x024C - 0x024C)
class UCThumbButton : public UCButton
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CThumbButton");
		return ptr;
	}

};


// Class NWindow.CBarCtrl
// 0x0028 (0x0218 - 0x01F0)
class UCBarCtrl : public UControl
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01F0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CBarCtrl");
		return ptr;
	}

};


// Class NWindow.CAnimTextureCtrl
// 0x0010 (0x023C - 0x022C)
class UCAnimTextureCtrl : public UCTextureCtrl
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x022C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CAnimTextureCtrl");
		return ptr;
	}

};


// Class NWindow.CAnimTexture
// 0x0020 (0x0130 - 0x0110)
class UCAnimTexture : public UTexture
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0110(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CAnimTexture");
		return ptr;
	}

};


// Class NWindow.2WordWrapperWnd
// 0x0030 (0x0208 - 0x01D8)
class U2WordWrapperWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x01D8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2WordWrapperWnd");
		return ptr;
	}

};


// Class NWindow.CNPCHtmlViewer
// 0x0008 (0x0284 - 0x027C)
class UCNPCHtmlViewer : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x027C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNPCHtmlViewer");
		return ptr;
	}

};


// Class NWindow.CHtmlViewer
// 0x0044 (0x0274 - 0x0230)
class UCHtmlViewer : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x0230(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CHtmlViewer");
		return ptr;
	}

};


// Class NWindow.CBBSHtmlViewer
// 0x48018 (0x4828C - 0x0274)
class UCBBSHtmlViewer : public UCHtmlViewer
{
public:
	unsigned char                                      UnknownData00[0x48018];                                   // 0x0274(0x48018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CBBSHtmlViewer");
		return ptr;
	}

};


// Class NWindow.CTutorialHtmlViewer
// 0x0000 (0x0274 - 0x0274)
class UCTutorialHtmlViewer : public UCHtmlViewer
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CTutorialHtmlViewer");
		return ptr;
	}

};


// Class NWindow.2FriendTreeCtrl
// 0x0008 (0x024C - 0x0244)
class U2FriendTreeCtrl : public UCTreeCtrl
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0244(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2FriendTreeCtrl");
		return ptr;
	}

};


// Class NWindow.2FriendTree
// 0x0000 (0x0218 - 0x0218)
class U2FriendTree : public UCTree
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2FriendTree");
		return ptr;
	}

};


// Class NWindow.snTreeCtrl
// 0x0014 (0x0258 - 0x0244)
class UsnTreeCtrl : public UCTreeCtrl
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0244(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.snTreeCtrl");
		return ptr;
	}

};


// Class NWindow.essengerWnd
// 0x0010 (0x028C - 0x027C)
class UessengerWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x027C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.essengerWnd");
		return ptr;
	}

};


// Class NWindow.2FriendWnd
// 0x003C (0x0214 - 0x01D8)
class U2FriendWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x01D8(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2FriendWnd");
		return ptr;
	}

};


// Class NWindow.snWnd
// 0x00EC (0x02C4 - 0x01D8)
class UsnWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xEC];                                      // 0x01D8(0x00EC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.snWnd");
		return ptr;
	}

};


// Class NWindow.ptionWnd
// 0x003C (0x02B8 - 0x027C)
class UptionWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x027C(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ptionWnd");
		return ptr;
	}

};


// Class NWindow.tatusWnd
// 0x0044 (0x021C - 0x01D8)
class UtatusWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x01D8(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.tatusWnd");
		return ptr;
	}

};


// Class NWindow.larmWnd
// 0x00C8 (0x02A0 - 0x01D8)
class UlarmWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x01D8(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.larmWnd");
		return ptr;
	}

};


// Class NWindow.oadingWnd
// 0x0010 (0x01E8 - 0x01D8)
class UoadingWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01D8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.oadingWnd");
		return ptr;
	}

};


// Class NWindow.ersionWnd
// 0x0010 (0x01E8 - 0x01D8)
class UersionWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01D8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ersionWnd");
		return ptr;
	}

};


// Class NWindow.oginWnd
// 0x0020 (0x01F8 - 0x01D8)
class UoginWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x01D8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.oginWnd");
		return ptr;
	}

};


// Class NWindow.snTree
// 0x0014 (0x022C - 0x0218)
class UsnTree : public UCTree
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0218(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.snTree");
		return ptr;
	}

};


// Class NWindow.2TaskWnd
// 0x0024 (0x02A0 - 0x027C)
class U2TaskWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x027C(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2TaskWnd");
		return ptr;
	}

};


// Class NWindow.2TaskBox
// 0x000C (0x0258 - 0x024C)
class U2TaskBox : public UCListBox
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x024C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2TaskBox");
		return ptr;
	}

};


// Class NWindow.2Task
// 0x001C (0x01F4 - 0x01D8)
class U2Task : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2Task");
		return ptr;
	}

};


// Class NWindow.2ChatWnd
// 0x0024 (0x02A0 - 0x027C)
class U2ChatWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x027C(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2ChatWnd");
		return ptr;
	}

};


// Class NWindow.2ChatFrameCtrl
// 0x0000 (0x0284 - 0x0284)
class U2ChatFrameCtrl : public UCBigTopFrameCtrl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2ChatFrameCtrl");
		return ptr;
	}

};


// Class NWindow.2ChatBox
// 0x0000 (0x024C - 0x024C)
class U2ChatBox : public UCListBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.2ChatBox");
		return ptr;
	}

};


// Class NWindow.essageDialog
// 0x0014 (0x0204 - 0x01F0)
class UessageDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x01F0(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.essageDialog");
		return ptr;
	}

};


// Class NWindow.emoveGroupDialog
// 0x0018 (0x0208 - 0x01F0)
class UemoveGroupDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01F0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.emoveGroupDialog");
		return ptr;
	}

};


// Class NWindow.enameGroupDialog
// 0x0018 (0x0208 - 0x01F0)
class UenameGroupDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01F0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.enameGroupDialog");
		return ptr;
	}

};


// Class NWindow.ddGroupDialog
// 0x0014 (0x0204 - 0x01F0)
class UddGroupDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x01F0(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ddGroupDialog");
		return ptr;
	}

};


// Class NWindow.oveGroupDialog
// 0x0060 (0x0250 - 0x01F0)
class UoveGroupDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x01F0(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.oveGroupDialog");
		return ptr;
	}

};


// Class NWindow.ddedConfirmDialog
// 0x0028 (0x0218 - 0x01F0)
class UddedConfirmDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01F0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ddedConfirmDialog");
		return ptr;
	}

};


// Class NWindow.emoveFriendDialog
// 0x0064 (0x0254 - 0x01F0)
class UemoveFriendDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x64];                                      // 0x01F0(0x0064) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.emoveFriendDialog");
		return ptr;
	}

};


// Class NWindow.ddFriendDialog
// 0x001C (0x020C - 0x01F0)
class UddFriendDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01F0(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ddFriendDialog");
		return ptr;
	}

};


// Class NWindow.fflineConfirmDialog
// 0x0010 (0x0200 - 0x01F0)
class UfflineConfirmDialog : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x01F0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.fflineConfirmDialog");
		return ptr;
	}

};


// Class NWindow.askWnd
// 0x0024 (0x02A0 - 0x027C)
class UaskWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x027C(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.askWnd");
		return ptr;
	}

};


// Class NWindow.askBox
// 0x000C (0x0258 - 0x024C)
class UaskBox : public UCListBox
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x024C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.askBox");
		return ptr;
	}

};


// Class NWindow.ask
// 0x0014 (0x01EC - 0x01D8)
class Uask : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x01D8(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.ask");
		return ptr;
	}

};


// Class NWindow.hatWnd
// 0x0928 (0x0BA4 - 0x027C)
class UhatWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x928];                                     // 0x027C(0x0928) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.hatWnd");
		return ptr;
	}

};


// Class NWindow.hatFrameCtrl
// 0x0000 (0x0284 - 0x0284)
class UhatFrameCtrl : public UCBigTopFrameCtrl
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.hatFrameCtrl");
		return ptr;
	}

};


// Class NWindow.hatBox
// 0x0000 (0x024C - 0x024C)
class UhatBox : public UCListBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.hatBox");
		return ptr;
	}

};


// Class NWindow.riendBox
// 0x0000 (0x024C - 0x024C)
class UriendBox : public UCListBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.riendBox");
		return ptr;
	}

};


// Class NWindow.nviteWnd
// 0x0018 (0x0294 - 0x027C)
class UnviteWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x027C(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.nviteWnd");
		return ptr;
	}

};


// Class NWindow.nviteBox
// 0x0004 (0x0250 - 0x024C)
class UnviteBox : public UCListBox
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x024C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.nviteBox");
		return ptr;
	}

};


// Class NWindow.CXMLDebugWnd
// 0x0008 (0x0284 - 0x027C)
class UCXMLDebugWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x027C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CXMLDebugWnd");
		return ptr;
	}

};


// Class NWindow.CCharacterViewportWnd
// 0x0050 (0x0228 - 0x01D8)
class UCCharacterViewportWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x01D8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CCharacterViewportWnd");
		return ptr;
	}

};


// Class NWindow.CFishViewportWnd
// 0x008C (0x0264 - 0x01D8)
class UCFishViewportWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x8C];                                      // 0x01D8(0x008C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CFishViewportWnd");
		return ptr;
	}

};


// Class NWindow.CViewportWnd
// 0x0000 (0x01D8 - 0x01D8)
class UCViewportWnd : public UCWnd
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CViewportWnd");
		return ptr;
	}

};


// Class NWindow.CServerInfoWnd
// 0x0008 (0x01E0 - 0x01D8)
class UCServerInfoWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CServerInfoWnd");
		return ptr;
	}

};


// Class NWindow.CServerFeatureWnd
// 0x0250 (0x0428 - 0x01D8)
class UCServerFeatureWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x250];                                     // 0x01D8(0x0250) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CServerFeatureWnd");
		return ptr;
	}

};


// Class NWindow.CServerSelectWnd
// 0x0048 (0x0220 - 0x01D8)
class UCServerSelectWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x01D8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CServerSelectWnd");
		return ptr;
	}

};


// Class NWindow.CServerSelectListCtrl
// 0x0004 (0x0278 - 0x0274)
class UCServerSelectListCtrl : public UCListCtrl
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0274(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CServerSelectListCtrl");
		return ptr;
	}

};


// Class NWindow.CBenchMarkResultWnd
// 0x0018 (0x01F0 - 0x01D8)
class UCBenchMarkResultWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x01D8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CBenchMarkResultWnd");
		return ptr;
	}

};


// Class NWindow.CPawnView_ShortCutWnd
// 0x0B44 (0x0D1C - 0x01D8)
class UCPawnView_ShortCutWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xB44];                                     // 0x01D8(0x0B44) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnView_ShortCutWnd");
		return ptr;
	}

};


// Class NWindow.CPawnViewer_SimulationMeshForce
// 0x0028 (0x0200 - 0x01D8)
class UCPawnViewer_SimulationMeshForce : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01D8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewer_SimulationMeshForce");
		return ptr;
	}

};


// Class NWindow.CPawnViewer_SimulationMesh
// 0x0098 (0x0270 - 0x01D8)
class UCPawnViewer_SimulationMesh : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x01D8(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewer_SimulationMesh");
		return ptr;
	}

};


// Class NWindow.CPawnViewer_Simulator
// 0x1F94 (0x216C - 0x01D8)
class UCPawnViewer_Simulator : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1F94];                                    // 0x01D8(0x1F94) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewer_Simulator");
		return ptr;
	}

};


// Class NWindow.CPawnViewer_HairChangeWnd
// 0x04D4 (0x06AC - 0x01D8)
class UCPawnViewer_HairChangeWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x4D4];                                     // 0x01D8(0x04D4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewer_HairChangeWnd");
		return ptr;
	}

};


// Class NWindow.CDebugWnd
// 0x0000 (0x024C - 0x024C)
class UCDebugWnd : public UCListBox
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CDebugWnd");
		return ptr;
	}

};


// Class NWindow.CPawnView_CharacterSelect_List
// 0x0004 (0x0250 - 0x024C)
class UCPawnView_CharacterSelect_List : public UCDebugWnd
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x024C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnView_CharacterSelect_List");
		return ptr;
	}

};


// Class NWindow.CPawnViewer_MixAnimWnd
// 0x0048 (0x0220 - 0x01D8)
class UCPawnViewer_MixAnimWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x01D8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewer_MixAnimWnd");
		return ptr;
	}

};


// Class NWindow.CPawnView_InvenTextWnd
// 0x0004 (0x01DC - 0x01D8)
class UCPawnView_InvenTextWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x01D8(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnView_InvenTextWnd");
		return ptr;
	}

};


// Class NWindow.CPawnView_CharacterSelectWnd
// 0x0040 (0x0218 - 0x01D8)
class UCPawnView_CharacterSelectWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x01D8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnView_CharacterSelectWnd");
		return ptr;
	}

};


// Class NWindow.CPawnViewerWnd
// 0x5748 (0x5920 - 0x01D8)
class UCPawnViewerWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x5748];                                    // 0x01D8(0x5748) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnViewerWnd");
		return ptr;
	}

};


// Class NWindow.CInvenItemWnd
// 0x0018 (0x0314 - 0x02FC)
class UCInvenItemWnd : public UCItemWnd
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02FC(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CInvenItemWnd");
		return ptr;
	}

};


// Class NWindow.CPawnView_InvenItemWnd
// 0x0000 (0x0314 - 0x0314)
class UCPawnView_InvenItemWnd : public UCInvenItemWnd
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnView_InvenItemWnd");
		return ptr;
	}

};


// Class NWindow.CPawnCreateWnd
// 0x0054 (0x022C - 0x01D8)
class UCPawnCreateWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x54];                                      // 0x01D8(0x0054) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CPawnCreateWnd");
		return ptr;
	}

};


// Class NWindow.CNpcView_CharacterSelectWnd
// 0x0A6C (0x0C44 - 0x01D8)
class UCNpcView_CharacterSelectWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xA6C];                                     // 0x01D8(0x0A6C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNpcView_CharacterSelectWnd");
		return ptr;
	}

};


// Class NWindow.CNpcView_CharacterSelect_List
// 0x0000 (0x024C - 0x024C)
class UCNpcView_CharacterSelect_List : public UCDebugWnd
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNpcView_CharacterSelect_List");
		return ptr;
	}

};


// Class NWindow.CNpcViewerWnd
// 0x5078 (0x52F4 - 0x027C)
class UCNpcViewerWnd : public UCFrameWnd
{
public:
	unsigned char                                      UnknownData00[0x5078];                                    // 0x027C(0x5078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNpcViewerWnd");
		return ptr;
	}

};


// Class NWindow.CNpcView_InvenItemWnd
// 0x0000 (0x0314 - 0x0314)
class UCNpcView_InvenItemWnd : public UCInvenItemWnd
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNpcView_InvenItemWnd");
		return ptr;
	}

};


// Class NWindow.CAnnounceWnd
// 0x000C (0x01E4 - 0x01D8)
class UCAnnounceWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01D8(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CAnnounceWnd");
		return ptr;
	}

};


// Class NWindow.CEulaWnd
// 0x0020 (0x01F8 - 0x01D8)
class UCEulaWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x01D8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CEulaWnd");
		return ptr;
	}

};


// Class NWindow.CWarningWnd
// 0x0014 (0x01EC - 0x01D8)
class UCWarningWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x01D8(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CWarningWnd");
		return ptr;
	}

};


// Class NWindow.CNoticeInfoWnd
// 0x20004 (0x20234 - 0x0230)
class UCNoticeInfoWnd : public UCScrollWnd
{
public:
	unsigned char                                      UnknownData00[0x20004];                                   // 0x0230(0x20004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CNoticeInfoWnd");
		return ptr;
	}

};


// Class NWindow.CMSViewerWnd
// 0x0040 (0x0218 - 0x01D8)
class UCMSViewerWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x01D8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMSViewerWnd");
		return ptr;
	}

};


// Class NWindow.CMSView_InvenItemWnd
// 0x0008 (0x031C - 0x0314)
class UCMSView_InvenItemWnd : public UCInvenItemWnd
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0314(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMSView_InvenItemWnd");
		return ptr;
	}

};


// Class NWindow.CMessageWnd
// 0x0014 (0x01EC - 0x01D8)
class UCMessageWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x01D8(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMessageWnd");
		return ptr;
	}

};


// Class NWindow.CMagicSkillWnd
// 0x0008 (0x01E0 - 0x01D8)
class UCMagicSkillWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CMagicSkillWnd");
		return ptr;
	}

};


// Class NWindow.CSkillWnd
// 0x000C (0x01FC - 0x01F0)
class UCSkillWnd : public UControl
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01F0(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSkillWnd");
		return ptr;
	}

};


// Class NWindow.CSkillItemWnd
// 0x0020 (0x031C - 0x02FC)
class UCSkillItemWnd : public UCItemWnd
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02FC(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CSkillItemWnd");
		return ptr;
	}

};


// Class NWindow.CCardKeyLoginWnd
// 0x001C (0x01F4 - 0x01D8)
class UCCardKeyLoginWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x01D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CCardKeyLoginWnd");
		return ptr;
	}

};


// Class NWindow.CAuthWnd
// 0x0024 (0x01FC - 0x01D8)
class UCAuthWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x01D8(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CAuthWnd");
		return ptr;
	}

};


// Class NWindow.CAuthWaitWnd
// 0x0004 (0x01DC - 0x01D8)
class UCAuthWaitWnd : public UCWnd
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x01D8(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class NWindow.CAuthWaitWnd");
		return ptr;
	}

};


// Class NWindow.CKeyCryptWarningDialogBox
// 0x0008 (0x01F8 - 0x01F0)
class UCKeyCryptWarningDialogBox : public UCDialogBox
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01F0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
